{
    "id": "2311.13731",
    "title": "A Survey of Blockchain, Artificial Intelligence, and Edge Computing for Web 3.0",
    "abstract": "Web 3.0, as the third generation of the World Wide Web, aims to solve\ncontemporary problems of trust, centralization, and data ownership. Driven by\nthe latest advances in cutting-edge technologies, Web 3.0 is moving towards a\nmore open, decentralized, intelligent, and interconnected network. However,\nincreasingly widespread data breaches have raised awareness of online privacy\nand security of personal data. Additionally, since Web 3.0 is a sophisticated\nand complex convergence, the technical details behind it are not as clear as\nthe characteristics it presents. In this survey, we conduct an in-depth\nexploration of Web 3.0 from the perspectives of blockchain, artificial\nintelligence, and edge computing. Specifically, we begin with summarizing the\nevolution of the Internet and providing an overview of these three key\ntechnological factors. Afterward, we provide a thorough analysis of each\ntechnology separately, including its relevance to Web 3.0, key technology\ncomponents, and practical applications. We also propose decentralized storage\nand computing solutions by exploring the integration of technologies. Finally,\nwe highlight the key challenges alongside potential research directions.\nThrough the combination and mutual complementation of multiple technologies,\nWeb 3.0 is expected to return more control and ownership of data and digital\nassets back to users.",
    "date": "2023-11-22T22:55:38+00:00",
    "fulltext": "1\nA Survey of Blockchain, Artificial Intelligence, and\nEdge Computing for Web 3.0\nJianjun Zhu, Fan Li, and Jinyuan Chen\nAbstract—Web 3.0, as the third generation of the World\nWide Web, aims to solve contemporary problems of trust,\ncentralization, and data ownership. Driven by the latest advances\nin cutting-edge technologies, Web 3.0 is moving towards a more\nopen, decentralized, intelligent, and interconnected network.\nHowever, increasingly widespread data breaches have raised\nawareness of online privacy and security of personal data.\nAdditionally, since Web 3.0 is a sophisticated and complex\nconvergence, the technical details behind it are not as clear as\nthe characteristics it presents. In this survey, we conduct an in-\ndepth exploration of Web 3.0 from the perspectives of blockchain,\nartificial intelligence, and edge computing. Specifically, we begin\nwith summarizing the evolution of the Internet and providing\nan overview of these three key technological factors. Afterward,\nwe provide a thorough analysis of each technology separately,\nincluding its relevance to Web 3.0, key technology components,\nand practical applications. We also propose decentralized stor-\nage and computing solutions by exploring the integration of\ntechnologies. Finally, we highlight the key challenges alongside\npotential research directions. Through the combination and\nmutual complementation of multiple technologies, Web 3.0 is\nexpected to return more control and ownership of data and digital\nassets back to users.\nIndex\nTerms—Web\n3.0,\nDecentralization,\nOwnership,\nBlockchain, Artificial Intelligence, Edge Computing.\nI. INTRODUCTION\nS\nINCE the second half of 2021, Web 3.0 has become\nubiquitous and gained widespread attention across various\nindustries. Web 3.0 is a new version of the World Wide Web\n(also known as the Web), which is the world’s dominant\nsoftware platform. According to the well-known statistical site\nStatista, as of October 2023, there were 5.3 billion web users\nworldwide, which accounts for 65.7% of the global population.\nNotably, social media users account for 93.4% of web users\n[1]. However, the vast online world is controlled by tech giants\nwho have absolute power compared to the general public. The\ncentralized platforms developed by tech giants gather personal\ndata from users and serve as both gatekeepers and arbiters\nin the delivery of their services, allowing them to shape\nand control what is available on the Web. Those platforms\ndrive most traffic to online news and hence have a significant\ninfluence on the sources of information that the general public\nconsumes on a regular basis. The primary beneficiaries are a\nsmall group of stakeholders. These platforms are unelected\nand difficult to audit. For the current dilemma, there is an\nurgent need for solutions to improve web environment while\nreturning control to users. This has laid a solid foundation for\nJianjun Zhu, Fan Li, and Jinyuan Chen are with Louisiana Tech University,\nDepartment of Electrical Engineering, Ruston, LA 71272 USA (e-mail:\njzh013@latech.edu; fanli@latech.edu; jinyuan@latech.edu).\nthe emergence of Web 3.0. Web 3.0 is a counter-proposal to\nthe current technological monopoly, providing a more holistic\nview of how society should use technologies [2].\nA. Motivations and contributions\nWhile Web 3.0 is still in its infancy, it has made significant\nadvances in creating an open, trustless, and permissionless web\nwhere users can share and exchange data without relying on\ncentralized organizations. However, there are still some major\nproblems that need to be addressed.\n1) True decentralization: The emerging industries support-\ning decentralized web are highly consolidated, which may un-\ndermine the realization of the decentralized vision of Web 3.0.\n2) Mass adoption: Technical barriers for using Web 3.0\nremain high, making it challenging for users to migrate to Web\n3.0 platforms. In addition, the differences between developing\nenvironments also pose challenges to Web 3.0 adoption.\n3) Storage/computation: Web 3.0 requires decentralized\nstorage and computation. However, building efficient decen-\ntralized solutions is challenging.\nWe are motivated by these problems to explore mitigation\nstrategies from a technical perspective. Fundamentally, Web\n3.0 is a convergence of emerging technologies. Among them,\nblockchain, artificial intelligence (AI), and edge computing\nare essential in this revolution, enabling users to use the Web\nsecurely and intelligently. Blockchain will allow individuals,\ncompanies, and computers to exchange data in a decentralized\nmanner. AI will empower computers with the ability to learn\nand reason to provide user-centered interactions. Edge com-\nputing allows faster processing and decision-making with low\nlatency by bringing computing and storage closer to where\nusers actually consume the data.\nBased on the concept that the architecture of Web 3.0 is\ntypically constructed using technology stacks [3], we propose\nan alternative stack architecture with varying emphases as\nillustrated in Fig. 1. In this paper, we will explore Web 3.0\nin-depth from the perspectives of blockchain, AI, and edge\ncomputing. The corresponding technology enablers will be dis-\ncussed in depth in each chapter. To the best of our knowledge,\nthere has been no comprehensive survey on Web 3.0 from\nthe perspective of these three technologies simultaneously. To\nsummarize, the main contributions of our work are discussed\nas follows:\n1) We discuss in detail the technical building blocks of Web\n3.0 and their necessity from the perspectives of blockchain, AI,\nand edge computing.\narXiv:2311.13731v1  [cs.CR]  22 Nov 2023\n2\nTABLE I\nA COMPARISON BETWEEN OUR SURVEY AND OTHER WORKS ON WEB 3.0.\nReference\nDescription\n[4]\nProviding an integrative literature review on the development of the Web.\n[5]\nConducting a review of decentralized Internet with a focus on consensus and other emerging technologies.\n[6]\nExploring blockchain-based Web 3.0 from an architecture identification and evaluation perspective.\n[7]\nAnalyzing key advances and potential impacts to emphasize the importance of Web 3.0.\n[8]\nIntroducing the evolution, technologies, and challenges of Web 3.0.\n[9]\nSurveying the impact of quantum technology on the development of blockchain-based Web 3.0.\n[10]\nInvestigating Web 3.0 application categories, popularity, challenges, and opportunities.\n[11]\nConducting a comprehensive overview of the latest advances of AI in Web 3.0.\nThis work\nProviding an in-depth analysis of Web 3.0 from the perspectives of blockchain, AI, and edge computing,\ndiscussing practical applications through a significant amount of concrete research works, and proposing\nsolutions for decentralized storage and computation through technological integration.\nInfrastructure \nlayer\nPeer-to-Peer\nEdge computing\nNetwork \nlayer\nProtocol \nlayer\nUse-case \nlayer\nEthereum\nSolana\nAvalanche\nCardano\nPolkadot\nAstar\nConsensus\nOff-chain\nCross-chain\nLayer-2\nsolutions\nNFTs\nDeFi\nDAO\nCognitive\nlayer\nAutoregression\nTransformer\nNLP\nCV\nGAN\nVAE\nFig. 1. Web 3.0 stack architecture.\n2) We survey state-of-the-art Web 3.0 practical applications\nto explore more convergence possibilities to improve the Web\n3.0 ecosystem.\n3) We propose and illustrate storage and computing solu-\ntions in decentralized scenarios by exploring the integration of\nblockchain, AI, and edge computing.\n4) We highlight critical challenges encountered in the de-\nvelopment of Web 3.0 with concrete data and discuss future\nresearch directions accordingly.\nB. Comparison with other surveys\nTo date, there have been several survey papers on different\naspects of Web 3.0. Our survey is distinctive from all the other\nsurveys as we conducted an in-depth analysis of the impact\nof blockchain, AI, and edge computing on the development\nof the Web 3.0 ecosystem. A comparison of our survey with\nother works on Web 3.0 is provided in Table I.\nComparatively, Voj´ıˇr et al. in [4] provided an integrative\nliterature review examining the development of the Web by\nanalyzing its evolution from centralization to decentralization\nand the reactions it provoked. Zarrin et al. in [5] showed\nthe potential of blockchain technology to provide a robust\nand secure decentralized Internet by exploring consensus al-\ngorithms and how blockchain can be combined with emerg-\ning technologies. Wang et al. in [6] conducted an in-depth\nexploration of Web 3.0 from the perspective of blockchain,\nidentifying twelve types of architecture by decoupling exist-\ning systems into core components. Ray in [7] emphasized\nthe importance of Web 3.0 in shaping a decentralized and\ndemocratized Internet by analyzing the key advances and\nimpacts of Web 3.0 applications and their integration with\nemerging technologies. Gan et al. in [8] provided an overview\nof Web 3.0 in terms of technologies, challenges, potential,\nand prospects. Ren et al. in [9] explored the fusion of various\nquantum information technologies with blockchain to develop\na resilient digital ecosystem based on blockchain. Huang et\nal. in [10] empirically investigated the categories of Web 3.0\napplications and their popularity, as well as the potential of this\nemerging field. Shen et al. in [11] provided a comprehensive\noverview of the latest advances of AI in Web 3.0, proposing\nand investigating the main challenges at each layer of the Web\n3.0 architecture.\nThe rest of this paper is organized as follows. Section II\nprovides relevant preliminaries such as the evolution of the\nWeb, current web issues, and background on blockchain,\nAI, and edge computing. Sections III-V provide an in-depth\nanalysis of each technology (i.e., blockchain, AI, and edge\ncomputing) for Web 3.0 in terms of relevance, fundamental\ncomponents, practical applications, and further insights. Sec-\ntion VI delves into the primary use cases of Web 3.0 and their\n3\npractical applications. Additionally, major issues from both\ntechnical and non-technical aspects are discussed. Section VII\ndiscusses the key challenges and further research directions.\nFinally, the work is concluded in Section VIII. An illustrative\norganizational structure of this survey is presented in Fig. 2.\nSection I: Introduction\nMotivations and contributions\nComparison with other surveys\nSection II: Preliminaries \nWhat is blockchain?\nMain issues of the current Web\nWhat is AI?\nWhat is edge computing?\nSection III: Blockchain for Web 3.0: a decentralized and trusted web \nOff-chain technology\nRelevance to Web 3.0\nCross-chain technology\nLayer 2 scaling solutions\nPractical applications of  blockchain in Web 3.0\nSection IV: AI for Web 3.0: an intelligent and semantic web \nGenerative AI\nRelevance to Web 3.0\nGenerative AI for Web 3.0\nWeb 3.0 for generative AI\nPractical  applications of  AI in Web 3.0\nSection V: Edge computing for Web 3.0: an interconnected and ubiquitous web \nIntegration of edge computing and blockchain: a storage solution\nRelevance to Web 3.0\nIntegration of edge computing and AI: a computing solution\nPractical applications of  edge computing in Web 3.0\nSection VI: Use cases for Web 3.0\nNFTs\nDeFi\nDAOs\nSection VII: Challenges and future research directions \nKey challenge and future direction in the context of blockchain\nKey challenge and future direction in the context of AI\nKey challenge and future direction in the context of edge computing\nSection VIII: Conclusion\nEvolution of the Web\nSummary and insights\nSummary and insights\nSummary and insights\nFig. 2. An illustrative organizational structure of this paper.\nII. PRELIMINARIES\nIn this section, we introduce the fundamentals of Web 3.0\nfrom the following aspects: evolution of the Web, main issues\nof current Web, and enabling technologies (i.e., blockchain,\nAI, and edge computing).\nA. Evolution of the current Web\nThe Web is a hypertext document management system\naccessible via the Internet. People can use a web browser to\naccess web pages hosted on web servers. In March 1989, Sir\nTim Berners-Lee proposed a system for managing information\nfor what would become the Web. He envisioned an intelligent,\nconnected, and data-driven network in which computers could\nanalyze all network data, including content, connections, and\ntransactions between users and computers. He advocated for\nthe European Council for Nuclear Research to provide the\nunderlying code for free in April 1993. This decision led to\ntoday’s Web [12], [13].\nWeb 1.0, also called the Static Web, is described as a web\nof interconnected information. Tim Berners-Lee coined it as\n“read-only” Web (see Fig. 3-a) since a massive majority of\nparticipants were content consumers. Content creators were\nbasically reporters, writers, and developers. Web 1.0 was not\ninteractive as it did not provide the features to browse the Web,\nwhich made it extremely difficult for content users to find\nthe needed information. The web pages were also proprietary,\nas many web browsers tried to attract users and stand out\nby providing proprietary content. This led to a series of\nincompatibility issues between web pages and web browsers.\nWeb 2.0, also called the Social Web, is the most familiar and\nwidely used Web today. The term “Web 2.0” was first proposed\nby Darcy Dinucci in 1999 and later promoted by Tim O’Reilly\nand Dale Dougherty as a “read-write” Web in late 2004 (see\nFig. 3-b) [14]. The focus of Web 2.0 is on enabling users to\ninteract with web content. Users are becoming more engaged\nin generating and sharing web content in addition to browsing.\nUsers can communicate with each other over the Web through\nsocial media platforms. They can create content in their own\nblogs that other users can access and interact with in discussion\nforums. The Web 2.0 period is also a time when mobile web\naccess has boomed. People can utilize their phones, tablets,\nand almost any other web-connected devices to access web\ncontent at any time. Overall, Web 2.0 applications demonstrate\na powerful front-end revolution with more opportunities to\ninteract with end users.\nWeb 3.0 was first coined by Gavin Wood, co-founder of\nEthereum, in 2014 as a way to minimize trust in a handful of\nprivate companies [3], [15]. It is a decentralized and fair In-\nternet reconstructed using distributed technology, where users\ncan control their own data and identity. Up until 2021, Web\n3.0 gradually entered the public consciousness and became\nmainstream. It is described as a “read-write-own” Web (see\nFig. 3-c) that enables users to acquire, create, and execute. Web\n3.0 does not rely on any third parties but rather allows users\nto interact directly with each other and with the web content\nthey are accessing through a peer-to-peer (P2P) network. This\nmakes privacy and security more assured because information\nis not stored in a data center that could be compromised.\nAdditionally, power will be handed back to the end users,\nwho no longer need permission from the tech giants to create,\n4\na) Web 1.0: read-only\nb) Web 2.0: read-write\nc) Web 3.0: read-write-own\nFig. 3. Evolution of the Web.\ntrade, and collaborate. A typical example is Solid proposed\nby Tim Berners-Lee in late 2020 [16]. The purpose is to\npropose a specification that allows users to securely store data\nin a decentralized manner to achieve true data ownership and\nimprove privacy. Notably, Web 3.0 is more than just a new\nwave of innovation. It is an opportunity to reset and enable new\nbenefits for ordinary users while solving some of the toughest\nchallenges posed by disruptive technologies of the past.\nB. Main issues of the current Web\nThe Web is among the most crucial innovations in the\nprogression of human technologies. It aims to serve as an open\nplatform that facilitates interaction, access, and information\nsharing across regional and cultural boundaries. From this\nviewpoint, the current Web has partially realized this vision\nsince it has brought many revolutionary changes to the Inter-\nnet. However, it has also raised some major issues [17].\n• Lack of ownership: The current business strategy of\nmany data-driven companies is to provide free services in\nexchange for personal data. The collected data is invisible\nto users. In addition, users lack ways to inform third\nparties that they do not want their data to be disclosed.\nAccording to a survey on personal information by Pew\nResearch Center [18], 62% of Americans believe that it is\nimpossible for their data not to be collected in their daily\nlives; 79% of Americans are very concerned about how\ncompanies use their personal data; 81% of Americans\nbelieve that they have little control over their personal\ndata. To make matters worse, the government is working\nwith tech companies to track online behavior and create\nsevere regulations that violate people’s privacy.\n• Centralization: Despite the decades-long history of the\nWeb, the network architecture is still based on the concept\nof stand-alone computers. Companies with significant\ncontrol over large data platforms are progressively con-\ncentrating data in their hands. These tech giants provide\nusers with online identities by holding their personal data\nand acting as gatekeepers of information. At the same\ntime, they likely have control over who is able to use\ntheir digital products. All activities on the platform need\nto be carried out with the permission of the platform. This\nbecomes a problem when people are denied the choices\nthat should be rightfully theirs. Whenever people interact\nover the Web, data will be sent to the central server. It\nshould be clear that the users will lose control over the\ndata when that happens which will also cause a serious\ncrisis of trust.\n• Privacy: Web 2.0 applications collect vast amounts of\npersonal and sensitive data by extensively tracking an\nindividual’s digital activities, social media posts, physical\nlocation, purchasing habits, and more to build highly\ndetailed digital profiles. However, individuals have little\nknowledge or control over what information is collected\nand how it is used. This data may be accessed or\ndisclosed by unauthorized parties, or misused by the\nservice provider itself. According to Statista, the number\nof exposed data records detected since 2020 has exceeded\n473 million data records [19]. This points to serious\nissues with this pervasive data collection under opaque\nusage policies, which can lead to unfounded behavioral\nprofiling, intrusive advertising practices, and inadvertent\ntargeting of vulnerable audiences.\n• Spread of misinformation: Data quality issues include\ndata inaccuracy, data inconsistency, and data duplication.\nIn Web 1.0, data quality was primarily determined by\nthe reputations of publishers. However, Web 2.0 reduces\ndata quality and leads to the spread of misinformation.\nThe majority of individuals acquire news and information\nfrom a handful of social media platforms and search\nengines. These companies determine what to display\nbased on the recommendation algorithms that learn from\npersonal data so that more profit can be achieved when\nusers click on links. This leads to these sites showing\nsome poor-quality data or even fake news that may\nsurprise and shock people and can spread like wildfire.\nAdditionally, those with malicious intent may exploit the\nsystem to disseminate false information for monetary or\npolitical gain.\n• Unfair reward system: The reward system in Web 2.0\nis unfair, with platforms reaping the vast majority of\nprofits from the content created by content creators. Only\na small percentage of the profits go to the individuals who\n5\nTABLE II\nBLOCKCHAIN CONSENSUS PROTOCOLS.\nTypes\nReference\nDescription\nBFT\nconsensus\nBEAT [20]\nA set of five asynchronous protocols focusing on practicality and efficiency\nHotStuff [21]\nA partially synchronous and leader-based protocol for linearity and responsiveness\nHoneyBager [22]\nAn asynchronous protocol constructed from an asynchronous common subset\nProteus [23]\nA protocol that achieves consistent performance by applying a root committee strategy\nSBFT [24]\nA protocol combining collectors, threshold signatures, a fast path, and redundant servers\nGosig [25]\nA protocol applying transmission pipelining and aggregated signature gossip\nPoX\nconsensus\nProof of Work [26]\nParticipants compete to solve computational puzzles to validate transaction blocks\nProof of Stake [27]–[29] Validators are selected to validate transaction blocks based on their stake\nProof of Activity [30]\nParticipants first solve cryptographic puzzles and then transit to a staking mechanism\nProof of History [31]\nVerifiers collectively creat a ledger with verifiable passage of time between events\nProof of Burn [32]\nParticipants burn some of their own tokens to gain the right to validate transactions\nProof of Importance [33] Participants harvest new blocks depending on their importance to the network\nProof of Replication [34] Prover provides evidence that a unique copy of the data is stored\nProofs of Space [35]\nParticipants prove their commitment by allocating significant amounts of storage space\nactually create the content. There are two main reasons\nfor this situation: The first reason is high concentration.\nAll network resources are owned and controlled by the\nplatform. The second reason is the unconsciousness of\ndata value. Most users are not aware of data value\nthey generate. The platform is also subtly telling people\nthe uselessness of data. In addition, centralized recom-\nmendation algorithms prefer data that can be widely\ndisseminated regardless of whether the data content itself\nhas positive value. This type of content recommendation\nis unbalanced, which greatly enriches the interests of a\nsmall group of top influencers.\nC. What is blockchain?\nA blockchain is essentially a global network of intercon-\nnected nodes that serves as a distributed database or ledger. It\ncontains blocks of transaction records that are shared by all\nparticipants in the network. Each block carries the digest of the\nprevious block, which is the output of the cryptographic hash\nfunction. This digest can be used to verify the validity of the\nprevious block, such that it connects the blocks into a growing\nchain. Blocks cannot be changed backward without affecting\nall the following blocks. This assures data confidentiality and\nintegrity, as well as the ability for blockchain participants to\nverify and audit transactions.\nThe consensus protocol is the fundamental building block\nof blockchain networks as well as the Web 3.0 ecosystem.\nAccording to the latest research on the priority of Web 3.0\ndevelopment factors, the most important factor in the develop-\nment of Web 3.0 is the consensus mechanism, with a weight\nof 20.0% [36]. Fundamentally, a consensus protocol was a\nfault-tolerant mechanism used between distributed processes\nto achieve a common agreement on a single data value. From\nthe perspective of blockchain, the consensus protocol is used\nby each participant to agree on the state of a distributed ledger.\nConsensus protocols ensure the reliability of blockchain net-\nworks by fostering trust among anonymous peers in a decen-\ntralized setting and enacting regulatory economic incentives\nin this way. There are many consensus mechanisms powering\nthe blockchain systems. Fundamentally, they can be broadly\ngrouped into two categories: Byzantine fault-tolerant (BFT)\nconsensus and Proof of Something (PoX) consensus (see\nTable II). A comparison between some of the most commonly\nused consensus protocols can also be found in [37]–[39].\nD. What is AI?\nAI is an interdisciplinary science that uses computers and\ndata to mimic the problem-solving and decision-making abil-\nities of the human brain. It includes machine learning (ML)\nand deep learning (DL), which are creating a paradigm shift\nand making breakthroughs in all different fields. Typically,\nhumans will play a role in supervised learning, providing pos-\nitive feedback for good decisions while preventing bad ones.\nHowever, certain AI systems are designed for unsupervised\nlearning, where they eventually figure out the rules through\npattern recognition and learning using large amounts of data.\n6\n2016\nAlphaGo\n2022\nChatGPT\n?\nperform intellectual tasks\nthat are beyond human\nabilities\nArtificial Super\nIntelligence\nMachine Consciousness\naim to replicate\nhuman-level\nintelligence\nArtificial General\nIntelligence\nMachine Intelligence\nfocus on specific\ntasks or domains \nArtificial Narrow\nIntelligence\nMachine Learning\nFig. 4. Levels of AI sophistication.\nEdge node\nEdge server\nEdge devices\nEdge\ndatabases\nEdge node\nNetwork edge\nEdge server\nEdge devices\nEdge\ndatabases\nFig. 5. Edge computing.\nIn terms of technical capabilities, there are three types of\nAI as shown in Fig. 4 [40]. One type is known as Artificial\nNarrow Intelligence (ANI), which has been integrated to\nimprove people’s daily lives. Both voice-controlled personal\nassistants and self-driving cars have benefited greatly from this\ntype of AI. In particular, breakthroughs in healthcare are also\ndependent on it, as it can greatly reduce repetitive tasks that\ncan lead to human errors, enhance the process of developing\nmedical materials, and improve treatment outcomes. Another\ntype of AI is called Artificial General Intelligence (AGI),\nin which the computer has greatly improved in intelligence\ncompared to the level of Web 2.0. It would be self-aware,\ncapable of problem-solving, learning, and long-term planning.\nIf development continues, it will reach the third type of AI, i.e.,\nArtificial Super Intelligence (ASI). With the advent of Web\n3.0, the booming development of various edge technologies\nwill propel AI into a more advanced stage.\nE. What is edge computing?\nEdge computing refers to the offloading of data storage and\ndata processing that were previously handled by centralized\nservers to the edge of the network close to end-user devices.\nThis technique helps reduce data transfer times and device\nresponse latency while easing bandwidth congestion on the\nnetwork. Costs associated with data transmission can be de-\ncreased by localizing processing at the edge. Decentralization\nis accomplished by dispersing computing away from central\nhubs. Additionally, shifting workloads to edge nodes with\nprocessing and storage capabilities helps effectively optimize\nresource usage.\nThe key components enabling edge computing are edge\ndevices, edge servers, edge databases, edge nodes, and network\nedge as shown in Fig. 5 [41]. Edge devices refer to the\ndevices that process data near the data source. For example,\nsmartphones, laptops, sensors, and industrial robots. Edge\nservers are information technology (IT) computing devices\nlocated near edge devices for computing IT workloads and\nresource management. Edge databases are database systems\nthat are deployed at the edge of the network. They are used to\nstore the data generated by the edge devices locally instead of\nsending to a centralized data server. Edge nodes are nodes\nthat hold edge devices, edge servers, and edge databases.\nThey are connected to the network and each other, acting as\nintermediaries to facilitate data exchange and resource sharing.\nThe network edge is the network infrastructure such as 5G\nand high-speed satellite Internet that connects edge devices\nand edge servers with low latency.\n7\nIII. BLOCKCHAIN FOR WEB 3.0: A DECENTRALIZED AND\nTRUSTED WEB\nWeb 3.0 is a decentralized network based on blockchain\ntechnology, collectively maintained by nodes scattered around\nthe globe. Blockchain redefines the way data is stored and\nmanaged. It uses cryptographic techniques to provide a unique\nset of states that can enable true P2P transactions without third\nparties. With blockchain, data will be stored on a decentralized\nnetwork rather than on a centralized server so that privacy\nand ownership will be given back to individuals [42]. Notably,\nblockchain combined with privacy-preserving technologies has\nthe potential to further enhance the protection of user privacy.\nTypically, website fingerprinting is a technique widely used in\nweb browser analysis to infer sensitive information about users\nby examining traffic patterns. In response to such attacks, some\nsignificant improvements have been proposed for website\nfingerprinting-based methods. For example, a TCP/IP traffic-\nbased defense mechanism was proposed in [43]. It is an\nefficient and low-overhead defense mechanism against attacks\nthat can filter out the injected noise. A traffic splitting-based\ndefense mechanism was proposed to limit the data that can be\nobserved by a single entry node in [44]. By embedding these\ndefense technologies, blockchain can provide additional layers\nof security on top of its inherent cryptographic protections and\ndecentralized framework.\nDue to its ability to store data in P2P networks, blockchain\nlays the foundation for Web 3.0. The protocol specifies the\nmanagement rules, which are guaranteed by a majority vote\nof all members of the network. Participants are rewarded for\ntheir contributions to network security and maintenance. It\nenables the individuals to reach a consensus while the network\nBlock\nBlock\nBlock\nDecentralized\nstorage\nConsensus\nDecentralized\ncomputation\nSmart contract\nEthereum Virtual Machine\n(Ethereum, Solana, etc.)\nPrivate Key-based Authentication\n(Wallet)\nFrontend\nBlockchain platform\nSmart contract\nSmart contract\ndApp\ndApp\ndApp\nFig. 6. Web 3.0 infrastructure from the perspective of blockchain.\nKey aspects of Blockchain\nin Web 3.0\n  Decentralization: to delegate power through decentralized networks. \n  Tokenization:  to revolutionize ownership, value, and exchange in Web 3.0.\n  Democratization: to democratize Web 3.0 via decentralized governance.\n  Digital Identity: to manage Web 3.0 interactions with unique digital identity.\n  Security&Privacy: to mitigate network attacks in Web 3.0 via consensus technique\nFig. 7. Relevance of blockchain to Web 3.0.\ncollectively records previous user interactions or events. As a\nresult, blockchain technology is certainly a powerful force that\ncan make the network more decentralized [45]. Web 3.0 is a\nbackend revolution with a network architecture as shown in\nFig. 6 [46], [47]. For average users, there will be no change\nto the interface of the Web. From a technical perspective, it is\na set of blockchain-based protocols designed to transform the\nbackend of the Web.\nIn this section, we will first show how blockchain tech-\nnology is closely related to Web 3.0. Then, we will explain\nthe criticality of blockchain for Web 3.0 from the perspective\nof specific technologies, i.e., off-chain technology, cross-chain\ntechnology, and layer 2 solutions. Afterward, we will introduce\nthe practical applications of blockchain in Web 3.0. Finally,\nthe summary and insights are provided.\nA. Relevance to Web 3.0\nWeb 3.0 is a decentralized and trustworthy Web, aiming to\ntransform a centralized network platform into a decentralized,\nsecure, and user-centric platform. Blockchain technology plays\na crucial role in realizing the vision of Web 3.0. This can be\ndemonstrated in several key aspects as shown in Fig. 7.\n1) Decentralization: One of Web 3.0’s visions is to build\na decentralized system that does not depend on a single\nentity but operates on a distributed network of nodes. The\ncore principle of decentralization is the delegation of power\nwhich requires the distribution of power and control outside\nof the central authority. The technological support comes from\nblockchain and its underlying P2P networks. Web 3.0 can\nhelp create more sustainable networks by decentralizing the\nenergy consumption associated with centralized data centers.\nBy distributing data and computing power among multiple\nnodes, blockchain-based systems can be more energy-efficient\nand environmentally friendly. For example, according to mea-\nsurements [48]–[51], the energy consumption per Algorand\ntransaction is approximately 0.000008 kWh, whereas each\nVisa transaction consumes around 0.0015 kWh. In terms of\ncarbon footprint, each Algorand transaction generates 0.0004\ngCO2 compared to the 0.45 gCO2 of each Visa transaction.\n8\nDecentralized Oracle\nNetwork\nOff-chain \ndata sources\n<101011000110>\nMain chain\n<101011000110, sig>\nMinority reports\nManage\nData-source\nauthentication\nDON trust\nminimization\nGuardrails\nTrust-minimized\ngovernance\nPublic-key\ninfrastructure\n(DON)\nFig. 8. Interactions between off-chain and on-chain resources via DON.\n2) Tokenization: Token is a digital scarcity in Web 3.0,\nwhich refers to the representation of real-world assets by\na string of numbers on the blockchain network. The im-\nmutability and public verifiability of the blockchain network\nguarantee the uniqueness, scarcity, and security of this digital\nstring. Tokens can be used to represent access rights, voting\nrights, or other types of ownership in applications. It also\nenables fractional ownership, which means assets can be\ndivided into smaller parts that can be easily bought, sold,\nor traded, enabling more people to participate in investment\nopportunities. Tokenization has great potential to revolutionize\nownership, value, and exchange in the Web 3.0 ecosystem.\n3) Democratization: One of the main features of Web 3.0\nis the democratization enabled by blockchain technology. Web\n3.0 promises to allow users to be rewarded based on their\ncontributions to the Web. However, democratizing in an error-\nfree and fair manner is a major challenge. Essentially, the\nmain problem that the blockchain solves is how to transfer\nvalue and control from the platform to the community, while\nmaintaining the prosperity of the platform. Decentralization\nand tokenization are two key aspects that are at the heart\nof the democratization of Web 3.0. Specifically, the decen-\ntralized nature of blockchain technology allows for trustless\ncooperation between stakeholders within the platform; then the\ntokenization of blockchain provides a fair way to incentivize\ndifferent stakeholders to participate in the governance and use\nof the platform.\n4) Digital universal identity: Digital identity is one of\nthe core elements of Web 3.0. It plays a key role in man-\naging Web 3.0 interactions. However, as data breaches and\nhacks expose the vulnerability of personal data, the utility\nand relevance of digital identities are becoming increasingly\napparent. In particular, the proliferation of social media has\nresulted in individuals having different digital identities on\ndifferent platforms. Online identity management faces serious\nchallenges. Blockchain technology can provide a decentralized\nand interoperable identity system for Web 3.0 users. This\nensures that each user has a secure, unique digital universal\nidentity across multiple platforms, eliminating the need for\nmultiple usernames and passwords.\n5) Security and privacy: Ensuring the security and pri-\nvacy of data and transactions is a crucial part of the rapid\ndevelopment of Web 3.0. Blockchain-based Web 3.0 can\nfundamentally eliminate the need for central institutions to\nmanage data. Moreover, the integration of blockchain in Web\n3.0 will greatly mitigate network attacks. Every data stream on\nthe blockchain network has to be verified by different nodes. A\nsuccessful network attack requires controlling the majority of\nnodes on the blockchain network in order to reach a consensus\non its proposals. At the same time, it has to compete with\npotential new blocks that are added. This is impractical for\nhackers, as they would be trapped in an endless computational\nloop, making it harder for them to compromise the network\nand access users’ personal information and transaction records.\nB. Off-chain technology\nOff-chain technologies play a critical role in augmenting\nblockchains in the Web 3.0 ecosystem. When blockchains are\nconnected to off-chain resources, their capabilities are greatly\nenhanced, from incorporating real-world information into on-\nchain execution to reducing costs and increasing through-\nput by shifting computation off-chain. However, to securely\nand immutably connect blockchain to external resources, the\noracle problem needs to be overcome. This problem refers\nto the inherent limitation of blockchains being unable to\ndirectly access or use external data resources due to their\nisolated nature. A blockchain oracle is an entity that connects\nblockchain to external systems, allowing smart contract (SCs)\nto execute based on real-world inputs and outputs in the Web\n3.0 ecosystem.\nThe decentralized oracle network (DON), proposed by\nChainlink in [52], acts as a secure middleware to facilitate\ncommunication between on-chain and off-chain resources as\nshown in Fig. 8. The DON obtains data from off-chain\nresources and then forwards the data to the SC deployed on the\nmain chain. Additionally, the DON incorporates a separate SC\nfor node management. Notably, one of the goals of Web 3.0\nis to minimize trust. The implementation of a DON involves\nintegrating a variety of trust-minimized technologies.\n9\nDecentralized account\nwith public address  \nCreate account (2)\nDeposit (3)\nLock (4)\nTriggering (6)\nGenerate and Manage (5)\nBTC\nETH\nLTC\nMint (7)\nwBTC wETH\nwLTC\nWithdraw (5)\nUnlock (4)\nTriggering (2)\nBTC\nETH\nLTC\nBurn (3)\nwBTC wETH\nwLTC\nDeposit request (1)\nWithdraw request (1)\nSmart contract\nDecentralized account\nwith public address  \nSmart contract\na) Deposit process\nb) Withdraw process\nFig. 9. Cross-chain assets deposit/withdraw flowchart.\n1) Data-source authentication: An important component of\ntrust minimization involves strengthening data-source authenti-\ncation through support for data signing tools and standards. By\ncryptographically signing the data they provide to SCs, a DON\nenables users to identify which nodes sent data and track the\nbehaviors to determine the quality of their performance. In this\nway, the end-to-end integrity of the data can be guaranteed.\n2) DON trust minimization: To minimize trust in DON,\nthere are two main methods. The first is the failover clients,\nwhich are backup clients for nodes in case of unexpected\nevents. They do not increase the number of potential attacks\nand can reduce reliance on individual client security as they\nare not deployed on the mainline. The second is the minority\nreport, which is a parallel report that is forwarded to SCs on\nthe main chain. This is an important mechanism that operates\nin a threshold manner to maintain the integrity and reliability\nof the data sources provided by the DON.\n3) Guardrails: Guardrails are a collection of trust mini-\nmization mechanisms involving the implementation of moni-\ntoring and fail-safety in SCs. A circuit breaker is a guardrail\nwhere a SC may control state updates based on inputs. For\nexample, it might be triggered if minority reports change\nsignificantly over time. Escape hatches are emergency facilities\nthat SCs can invoke to terminate pending transactions and\nfuture transactions in adverse circumstances. Failover means\nthat SCs can provide a failover mechanism to ensure the\ncontinuity of services even in the event of DON failure.\n4) Trust-minimized governance: Evolutionary governance\nand emergent governance are two types of trust-minimizing\ngovernance mechanisms. Evolutionary governance is about\ndeploying changes gradually, ensuring the community has\nthe opportunity to respond. Emergency governance refers\nto vulnerabilities in SC that require immediate intervention\nto avoid catastrophic consequences. Specifically, emergency\ngovernance uses a multi-signature intervention mechanism to\nensure that signers dispersed across organizations are always\navailable to authorize emergency changes.\n5) Public-key infrastructure: As decentralization contin-\nues to advance, a strong public key infrastructure (PKI) is\nrequired to reliably identify network participants, including\nDON nodes. The foundation of PKI in DON is the Ethereum\nName Service (ENS). ENS allows human-readable Ethereum\nnames to be mapped to blockchain addresses. Tampering with\nthe name is inherently as difficult as tampering with the SC\nthat governs it unless the keys are compromised.\nC. Cross-chain technology\nA blockchain is a decentralized system powered by dis-\ntributed ledger technology. However, it is not a cumulative\necosystem since each blockchain is designed for a particular\nuse. They have specific advantages, limitations, and varying\nlevels of decentralization. For example, if a blockchain aims to\nachieve high transaction throughput, it may be less decentral-\nized and less secure. Since each blockchain is isolated from the\nothers, leveraging the functionality of one blockchain cannot\ncompensate for another. To fully take advantage of blockchain\ntechnology, cross-chain technology was developed to address\ninteroperability, which can greatly boost productivity in the\nWeb 3.0 ecosystem [53]–[55]. Everyone involved will benefit\nfrom the increased flexibility, as users will be able to easily\ntransfer assets and data between blockchains [56]. Given the\nwide variety of bridge designs, the most widely adopted bridge\ndesign is based on the lock-mint-burn method as shown in\nFig. 9 [57]. Basically, this type of bridge designates a public\n10\nLayer 2 \nsolutions\nRollups\nState channels\nSidechains\nOptimistic\nrollups\nZero-\nknowledge\nrollups\nBitcoin’s\nLightning\nnetwork\nEthereum’s\nRaiden\nnetwork\nLiquid\nnetwork\nPolygon \nPoS\nFig. 10. Layer 2 solutions with typical projects.\naddress on the source chain for users to deposit their tokens.\nOn the destination chain, a SC will mint the wrapped tokens\n1:1 with the tokens held in the decentralized managed account\nand send them to the user’s wallet.\nCross-chain technology enables trade-offs between two or\nmore blockchains in terms of efficiency, decentralization, and\nsecurity. Additionally, cross-chain technology can improve\nchain efficiency, reduce fragmentation, and enable a free flow\nof users and features between multiple blockchains. In recent\nyears, cross-chain platforms with different goals have been\ndeveloped. For example, tBTC is an Ethereum-like token that\nis linked to the value of Bitcoin [58]. It enables Bitcoin holders\nto gain access to the Ethereum ecosystem and decentralized\nfinance (DeFi) applications. Parity Bridge is a cross-chain\nsolution to connect fast and cheap Proof of Authority chains\nwith the Ethereum public network and any other Ethereum-\nlike PoW chain [59]. Wormhole is a communication bridge\nbetween Solana and other mainstream blockchain networks\n[60]. Existing projects, platforms, and communities are able\nto seamlessly transfer digital assets across blockchains by\nutilizing Solana’s high-speed and low-cost features.\nD. Layer 2 scaling solutions\nBlockchain-based Web 3.0 will revolutionize the way people\ntransact and transfer value with each other. However, with\nits rapid development, scalability has become a bottleneck.\nTo solve this problem, scaling solutions developed on top of\nLayer 1 blockchain networks, also called Layer 2 solutions,\nare widely adopted. The purpose is to improve the scalability,\nefficiency, privacy, and other characteristics of the underlying\nblockchain network. There are several types of Layer 2 so-\nlutions. For example, rollups, state channels, and sidechains.\nBelow is an overview of Layer 2 solutions as shown in Fig. 10.\n1) Rollups: Rollups allow transactions to be executed out-\nside the Layer 1 blockchain. When consensus is reached on\nthe transaction data, the data will be posted back to the\nmain chain and secured by the security mechanism of the\nunderlying blockchain. Specifically, there are two types of\nrollups in terms of security models: optimistic rollups and\nzero-knowledge (ZK) rollups [61]. An optimistic rollup is\nan approach used to scale the Ethereum network by moving\nsome computations and state storage off-chain. In ZK rollups,\ntransactions are bundled into batches and executed outside\nthe Layer 1 blockchain. The summary of changes will be\nsubmitted to the main blockchain, rather than submitting each\ntransaction individually. To guarantee the correctness of the\nchanges, they provide proof of validity by utilizing zero-\nknowledge proofs. The rollup paradigm is based on a final\nsettlement on the Layer 1 blockchain. It requires rollups to post\na copy of every transaction to the Layer 1 blockchain. In order\nto address the data availability bottleneck, it is necessary to\ncreate dedicated space for rollups. For example, Danksharding\nscales Ethereum for high throughput by scaling the number of\nbinary large objects (a.k.a. blobs) attached to blocks from 1\nto 64 [62].\n2) State channels: State channels enable participants to\nsecurely transact off-chain by utilizing multi-signature con-\ntracts. Then, two on-chain transactions that can open and close\nthe channel are submitted for final settlement with the main\nnetwork [61]. State channels represent a more generalized\nform of payment channels. They can be utilized not only for\npayments but also for any state updates on the blockchain, such\nas changes within a SC. The most well-known examples are\nBitcoin’s Lightning network and Ethereum’s Raiden network.\nThe Lightning Network is a decentralized payments network\nthat runs on top of the Bitcoin blockchain. It greatly improves\nthe scalability of the Bitcoin blockchain by allowing users\nto make multiple transactions off-chain without broadcasting\neach transaction to the entire network. Near-instant and low-\ncost Bitcoin settlements can be achieved between participants.\nThe Lightning Network uses a two-party, multi-signature Bit-\ncoin address (channel) to store funds. It requires both parties\nto agree on the new balance to spend funds from the channel.\nIn this case, the network allows dynamic participation so\nthat payments can be made through a network of channels\n[63]. Similarly, the Raiden network is Ethereum’s version\nof Bitcoin’s Lightning Network. It enables the transfer of\ntokens that are compliant with the ERC20 standard on the\nEthereum blockchain. This is achieved through the use of\ndigital signatures and hash-lock (i.e., balance proof). Digital\nsignatures ensure that neither party can exit any value transfers\ncontained therein, as long as at least one participant decides\nto submit it to the blockchain. The Raiden balance proof is a\nprotocol executed by the Ethereum blockchain. Since no one\nother than these two participants can access the tokens stored\nin the payment channel SC, the Raiden balance proof is as\nbinding as on-chain transactions [64].\n3) Sidechains: A sidechain is an independent blockchain\nthat is linked to the main blockchain. It allows assets to move\nbetween the sidechain and the main chain. The purpose is to\nsolve scalability issues by offloading some of the validation\nand transaction processing to the sidechain [61]. Sidechains\ninteract with Layer 1 blockchains in two primary ways: the\nfirst way is to provide a mechanism (i.e., a cross-chain bridge)\nfor bridging assets from Layer 1 blockchain to their respective\nsidechain; the second method involves periodically publishing\nits state snapshots (i.e., highly compressed summaries of the\nbalances of all accounts on its network) to Layer 1 blockchain\nnetwork [65]. Examples of sidechains include the Liquid net-\nwork and Polygon Proof of Stake (PoS). The Liquid Network\nis a sidechain of the Bitcoin blockchain. It facilitates fast,\n11\nApplications of\nBlockchain in \nWeb 3.0\nShared \nDatabase [69]\nInteroperability\nPlatform [70]\n Power Transaction\nPlatform [71]\nBlockchain-Semantic\nFramework [72]\nData Sharing\nPlatform [75]\nSemantic\nExchange [76]\nPrivacy-Preserving\nComputing [77]\nDecentralized \nStorage [68]\nSocial \nNetwork [73]\nAuthentication\nMechanism [74]\nRadio Access\nNetwork [78]\nTransition \nFramework [79]\nFig. 11. Applications of blockchain in Web 3.0.\nsecure, and private settlement of digital assets. The Liquid-\nversion Bitcoins are backed by an equal amount of Bitcoins\non the main chain, ensuring verifiable 1:1 backing. This allows\nusers to trade using the speed and confidentiality of the Liquid\nnetwork [66]. Polygon PoS is a 3-layer architecture sidechain\nof the Ethereum blockchain to connect Ethereum-compatible\nblockchain networks. The Ethereum layer consists of a set of\nstaking SCs on the main chain, allowing users to stake tokens\nto join the system. The Heimdall layer is a validation layer,\nconsisting of PoS Heimdall nodes that run in parallel to the\nmain chain. These nodes monitor the staking SCs and commit\ncheckpoints from Polygon to the Ethereum main chain. The\nBor layer is a layer for producing sidechain blocks. It is used\nto aggregate transactions into blocks for periodic verification\nby Heimdall nodes [67].\nE. Practical applications of blockchain in Web 3.0\nIn this section, we further explore the applications of\nblockchain in Web 3.0, as shown in Fig. 11, to provide\nintuitions on how to leverage blockchain in the Web 3.0\necosystem. Benet in [68] designed a P2P distributed file\nstorage system called InterPlanetary File System (IPFS). It\nis a modular suite of protocols for storing and sharing data,\naiming to store files by connecting computing devices around\nthe world to the same file system. It plays a crucial role as\nthe file storage solution underlying the decentralized vision of\nWeb 3.0. Compared to traditional centralized storage solutions,\nIPFS uses a global P2P network, allowing for permanent\nand immutable data storage without single points of failure.\nIts content addressing and distributed hash table technology\nensure fast and reliable file retrieval. Drakato et al. in [69]\nproposed Triastore, a blockchain database system that can\nstore and retrieve ML models from the blockchain. To this\nend, Triastore introduced Proof of Federated Learning for a\nglobal model, and Blockchain Consensus for committing the\ngenerated model data to a blockchain database. In the context\nof Web 3.0, the authors claimed that Triastore has the potential\nfor big data analytics in telecommunications and smart city\napplications. Liu et al. in [70] proposed an interoperability\nplatform, HyperService, that provides interoperability and\nprogrammability between blockchains in order to make the\nWeb 3.0 ecosystem connected. In particular, HyperService is\npowered by a unified programming framework for developers\nand a secure cryptographic protocol for blockchain. A Web\n3.0-based P2P platform, VA3, was developed by Chopra et\nal. in [71] for electricity settlement at an individual level.\nSpecifically, VA3 automates the measurement of power con-\nsumption and production by feeding this data into a SC to\nmodify the home router. Then, the SC could automatically\nmanage electricity settlements. Lin et al. in [72] proposed\na blockchain-semantic framework for Web 3.0, aiming to\naddress the problem of unsustainable resource consumption\nfor computation and storage due to the explosive growth of\non-chain content and the growing user base. Specifically, an\nOracle-based proof of semantic mechanism was introduced to\nfacilitate on-chain and off-chain interactions while maintaining\nsystem security. Additionally, a DL-based sharding mechanism\nwas designed to improve interaction efficiency. Palanikkumar\net al. in [73] proposed a decentralized social network system\nimplemented using the Web 3.0 Library, which is a collection\nof Ethereum JavaScript application programming interfaces\n(APIs). This library provides functionalities to interact with the\nEthereum blockchain. In this way, an Online Social Network\n(OSN) service was created in a decentralized manner for\ndemocratic self-management. Petcu et al. [74] proposed a\nnovel authentication mechanism utilizing Ethereum blockchain\ntechnologies, enabling the browser to interact with the user’s\nsoftware and hardware wallets to implement user authen-\ntication. With this approach, Web 3.0 authentication could\nprovide enhanced security, privacy, and ownership of user\ndata compared to existing authentication methods that rely\non third-party authentication service providers. Razzaq et al.\nin [75] proposed a Web 3.0 Internet of Things (IoT) data\nsharing framework based on IPFS. Specifically, blockchain\nand SCs are used to provide data security. Hybrid storage\nis used to achieve secure data exchange. Additionally, access\ncontrol policies are stored on-chain to ensure policy integrity\nand allow for public auditing of any policy changes. Lin\net al. in [76] proposed a blockchain-based framework for\nsemantic exchange in Web 3.0, which aims to achieve fair and\nefficient interactions. Specifically, it first tokenized semantic\ndata as non-fungible tokens (NFTs). Trading strategies were\nthen optimized via the Stackelberg game. Afterward, ZK proof\nwas leveraged to allow the sharing of authentic semantic\ninformation. Guo et al. in [77] proposed a privacy-preserving\ncomputing architecture in Web 3.0. The main building blocks\nare state channel and computing sandbox, used to ensure\nsecure and reliable computation. In addition, the onion routing\ntechnology was used to preserve user privacy. Qiu et al. in\n[78] proposed a framework, called FogBC-RAN, to establish\na secure and decentralized communication system in Web 3.0.\nTo this end, a cross-chain information transmission process\nwas introduced for efficient cost-sharing. Additionally, a com-\n12\nputational offloading strategy using matching game theory was\nused to minimize the system cost of computationally intensive\nWeb 3.0 applications. Yu et al. in [79] proposed a framework\ncalled WebttCom that allows for a transition from Web 2.0\nto Web 3.0. The proposed framework can build a connection\nbetween traditional Web 2.0 applications and Web 3.0 plat-\nforms, ensuring data privacy and governance while improving\ndevelopment efficiency. Specifically, an interpreter mechanism\nwas used to aggregate and process requests between the Web\n2.0 and Web 3.0 domains.\nF. Summary and insights\nOff-chain, cross-chain, and layer 2 solutions play a vital role\nin the blockchain-based Web 3.0 system. Off-chain technology\ngreatly expands Web 3.0’s ability to provide solutions to the\nreal world by connecting on-chain and off-chain resources.\nCross-chain technology provides interoperability for isolated\nblockchain platforms, jointly promoting the development of\nthe Web 3.0 ecosystem. Layer 2 solutions improve the scalabil-\nity of blockchain-based Web 3.0 by offloading computationally\nintensive operations. These technologies demonstrate effec-\ntiveness in their respective focuses while taking into account\nother aspects, such as decentralization, security, and privacy.\nHowever, it is challenging to make effective tradeoffs. It is\nimportant to first identify key concerns and then develop a\nlogical strategy. For example, scalability may take precedence\nover decentralization and security in DeFi, whereas security\nand decentralization are more important than scalability in the\nNFT market.\nIV. AI FOR WEB 3.0: AN INTELLIGENT AND SEMANTIC\nWEB\nAI plays a crucial role in realizing a more decentralized,\nsecure, and user-centered Web 3.0. By effectively integrating\nAI technology into various areas of the Web 3.0 ecosystem, it\nis promising to bring about an era of more intelligent, efficient,\nand personalized digital experiences. However, the dominance\nof centralization has been a longstanding characteristic of AI-\nbased solutions due to their heavy reliance on centralized\nmassive datasets and computing resources. Traditional AI\ntechniques typically require aggregating large amounts of data\nand performing computationally intensive training processes.\nThis has inevitably led to a centralization of both the data and\ninfrastructure that AI advances have been built upon up to this\npoint. In contrast, Web 3.0 aims to build a decentralized archi-\ntecture with no single point of control, raising novel challenges\nfor integrating AI in a manner that is distributed, privacy-\npreserving, and aligned with the vision of decentralization.\nAs we explore the decentralized landscape of Web 3.0, it\nis necessary to consider how AI can adapt its centralization\ntendencies in order to flourish in this emerging environment.\nIn this section, we first show the relevance of AI and\nWeb 3.0. Then we illustrate how generative AI and Web 3.0\ncomplement each other through an in-depth study of generative\nAI. Afterward, we will introduce the practical applications of\nAI in Web 3.0. Finally, the summary and insights are provided.\n1\nHighly Targeted Content\nAI is used in Web 3.0 to deliver personalized and targeted\ncontent and reduce irrelevant advertising.\n2\nAutomation, personalization, and content creation through\nAI will significantly reduce manual tasks in Web 3.0.\nAutomated Content Creation\n3\nWeb 3.0 facilitates online community building by\nanalyzing user interests via AI to enable collaboration.\nIncreased Community Building\n4\nAI powers personalized Web 3.0 by optimizing user interfaces\nand delivering targeted results for an enhanced experience.\nBetter User Experience\n5\nSmart contracts enabled by AI can simplify data management\nby facilitating a consistent, high-quality decentralized database.\n\"Smarter\" Contract\nFig. 12. Relevance of AI to Web 3.0.\nA. Relevance to Web 3.0\nWeb 3.0 represents an intelligent and personalized Web with\nthe goal of providing users with a more seamless experience.\nAI can drive the applications of Web 3.0 to handle more\ncomplex tasks due to its ability to process and analyze large\namounts of data. The high correlation between AI and Web\n3.0 can be seen from the following key aspects as shown in\nFig. 12.\n1) Highly targeted content: Web 3.0 is powered by AI\ntechnology to provide consumers with more personalized\nand targeted advertising. With the ability to understand user\nintent and preferences, Web 3.0 allows for more effective\nand efficient marketing campaigns. As a result, annoying and\nirrelevant advertisements can be eliminated. Only the most\nrelevant content is available to customers. For example, in\ne-commerce, recommender systems make personalized prod-\nuct recommendations by analyzing users’ browsing behavior,\nsearch history, and purchase history.\n2) Automated content creation: Web 3.0 allows for the\ncreation of smarter, connected, and interactive web experiences\nthat automate more complex tasks and reduce the need for\nhuman intervention. In Web 3.0, automated content creation\nwill become more prevalent through the use of AI technolo-\ngies. High-quality and dynamic content can be generated based\non user queries and preferences. For example, ChatGPT not\nonly helps users generate personalized product descriptions\nand marketing materials but also optimizes them in a real-\ntime interactive manner.\n3) Increased community building: Web 3.0 is expected to\nfoster community building through the utilization of AI tech-\nnologies. AI helps connect people with similar interests, skills,\nand goals by analyzing user behavior and preferences, thereby\ncreating more meaningful discussions and collaborations in\n13\nGPT-4\nGPT-3\nLaMDA\nChinchilla\nTongyi Qianwen\nErnie 3.0 Titan\nLLaMA\nBloom\nDialoGPT\nNeural Networks\nColab/Telegram\nBloomBot\nVicuna\nErine\nDingTalk\nSparrow\nBARD\nBing\nChatGPT\nText Generation\nAudio Generation\nImage Generation\nVideo Generation\nCode Generation\nArtwork\nGeneration\nTranslation\nData Analysis\nData Visualization\nVirtual Assistant\nMultimodal data\nLLMs\nChatBots\nApplications\nAudio\nText\nImage\nVideo\nAudio\nText\nImage\nVideo\nTransformer-based\nModels\nGAN-based Models\nVAE-based Models\nAutoregressive-based\nmodels\nFig. 13. Generative AI.\nonline communities to increase engagement and build a sense\nof community. In this way, the Web will be more interactive,\nintelligent, and connected.\n4) Better user experiences: The convergence of Web 3.0\nand AI holds significant potential in enhancing the user\nexperience. AI can deliver more precise and relevant results\nto Web 3.0 users, as well as personalize their interfaces\nto improve the usability and accessibility of Web 3.0. In\norder to accomplish this goal, AI-enabled websites need to\nclassify data and present information that is deemed useful\nto individual users, providing a personalized and improved\nnavigation experience. Users will search and find what they\nneed more easily and precisely, making Web 3.0 applications\nmore user-friendly. From this point of view, prioritizing user\nexperience throughout the entire development of Web 3.0\napplications will be more important than ever.\n5) “Smarter” contract: In the era of Web 3.0, data man-\nagement will be more important than ever as data becomes\nmore complex and time-consuming to manage. Additionally,\nthe nature of data ownership means that data will not be\nmanaged on a central server. As a decentralized solution, SCs\ncan produce a clean version of data by connecting multiple\ndata sources. In particular, when combined with AI, SCs have\ngreat potential to improve and simplify data management and\navoid duplicate aggregation. If the underlying P2P network\nof Web 3.0 is regarded as a unified database, AI-powered\nSCs will facilitate the establishment of a consistent and high-\nquality database.\nB. Generative AI\nGenerative AI has emerged as the most exciting technology\nof AI advancement within two years. It empowers various\napplications by creating new data that is similar to human-\ngenerated data as shown in Fig. 13. Notably, generative AI\nhas gained significant interest in semantic communication\n[80]–[84] and edge network [85]–[89]. The rapid growth is\nattributed to the creation of large language models (LLMs)\nthat may have billions or even trillions of parameters [90],\n[91]. Unlike traditional AI, which focuses on analyzing and\nprocessing existing data to accomplish tasks such as classifica-\ntion and clustering, generative AI creates new and original data\nby learning patterns and features from existing datasets. With\ngenerative AI, Web 3.0 will be more creative and engaging\nthan ever before. The development cycle of decentralized\napplications (dApps) will be dramatically shortened to help\ncompanies stay ahead of the competition. In addition, gen-\nerative AI has the potential to fundamentally change the\nway a wide range of traditional industries operates due to\nthe highly automated creative process. In the entertainment\nindustry, generative AI has brought huge disruption to the film\nindustry.\n1) Underlying technologies: Natural Language Processing\n(NLP) and Computer Vision (CV) are two distinct subfields\nof AI. The former focuses on the interaction between com-\nputers and human language. The latter focuses on enabling\nmachines to interpret and understand visual information. Both\nare important components of generative AI.\n14\n• NLP: NLP is dedicated to empowering computers to\ncomprehend and react to text or speech input in the\nsame manner that humans respond to their own text or\nspeech. NLP makes it possible for computer algorithms\nto effectively summarize massive volumes of information\nand translate text across languages and spoken commands\n[92]. This is critical in Web 3.0 as natural language is\nambiguous, making it difficult for algorithms to accu-\nrately recognize and process text or audio data. With\nthe increase in computing power and a large amount\nof decentralized data available in Web 3.0, computers\nwill be intelligent enough to interpret information to\nprovide faster and more precise results, which makes\nmachines virtually indistinguishable from human users.\nImagine that a voice assistant in Web 3.0 is able to\nprocess all the unstructured data on the network. They\nwill comprehend the meaning of anything on the web\nand deliver a thorough answer rather than merely replying\nwith Wikipedia information and reading Web 2.0 articles\n[93]–[95].\n• CV: CV aims to use computers to extract features from\na large number of visual inputs and then provide rec-\nommendations. The computer will develop the ability to\ndistinguish between images if enough data is supplied\ninto the model. This will be greatly met in Web 3.0\nwith the explosive growth of decentralized data volume.\nConvolutional neural networks (CNN)-type algorithms\nand recurrent neural networks (RNN)-type algorithms are\nthe pillars of computer vision [96], [97]. A CNN aids\na computer’s vision by breaking down an image into\nlabeled pixels which will be further used to perform\nconvolutional operations. Similarly, RNN techniques are\napplied in video applications to assist computers in\nunderstanding the connections between images within a\nsequence of frames. The development of self-driving cars\nrelies on computer vision to interpret visual inputs from\ncar cameras and other sensors, in order to understand the\nenvironment. It is crucial for distinguishing other objects\non the road, such as various automobiles, traffic signs,\npedestrians, and all other visual information.\n2) Types of generative AI: Generative AI is a form of\nunsupervised learning, which means that the model learns to\ngenerate new data samples without being explicitly told what\nthe correct output should be. Instead, the model is trained on a\nlarge dataset of examples and learns to capture the underlying\npatterns and structures in the data. There are four main types\nof generative models as shown in Fig. 13, including trans-\nformers, generative adversarial networks (GANs), variational\nautoencoders (VAEs), and autoregressive models.\n• Transformers: A transformer model is a neural network\nthat understands contextual meaning by analyzing re-\nlationships and patterns in sequential data [98]. It is\nbased on an attention mechanism to selectively prioritize\ndifferent parts of the input sequence to produce relevant\noutputs. It consists of an encoder and a decoder. The\nencoder processes input sequences to generate latent\nrepresentations that capture semantic information. One of\nthe key advantages is its ability to process input sequences\nin parallel, which makes it much faster than traditional\nRNNs for long sequences. This, together with its effec-\ntiveness in capturing long-range dependencies (a subtle\nway of detecting the interactions and interdependencies\nof even distant data elements in a series of data), makes\nthe transformer model a fundamental model driving a\nparadigm shift in AI.\n• GANs: One of the key breakthroughs in the development\nof generative AI was the introduction of GANs [99]. A\nGAN involves a generator and a discriminator. These two\nnetworks oppose each other, using a two-player game-like\napproach to generate new data. The generator generates\nnew data based on patterns it learns from the training\ndataset while the discriminator evaluates the authenticity\nof the generated data. This adversarial training approach\nallows the generator to generate data that is indistinguish-\nable from real data, while the discriminator has enhanced\ncapabilities in identifying the generated data.\n• VAEs: A VAE is a neural network for unsupervised\nlearning of complex data distributions [100]. It involves\ntwo sub-processes: the encoder maps input data into\na latent space; the decoder then draws samples from\nthe data distribution in this latent space to generate the\noutput. Unlike traditional autoencoders, VAEs introduce\nrandomness into the encoding process, which allows them\nto be used in generative AI for generating new data with\nsimilar patterns to the input data. Furthermore, they could\nbe combined with other generative models to create more\nadvanced and powerful generative models.\n• Autoregressive models: An autoregressive model is a type\nof statistical model used for forecasting future values in\ntime series data based on prior observations [101]. It\nis assumed that there is an auto-correlated structure in\nthe data where the current value of a time series can\nbe modeled as a linear combination of prior values in\nthe series. The term “autoregressive” comes from the\nfact that these models involve regressing a time series\ndata to its own past values. However, autoregressive\nmodels are primarily used for stationary time series with\nconstant mean and variance over time. Non-stationary\ntime series may require transformation before applying\nan autoregressive model.\nC. Generative AI for Web 3.0\nWeb 3.0 is envisioned to transform the Internet into a\nsemantic, intelligent, and user-centric platform where informa-\ntion is interconnected through semantic understanding. Gener-\native AI plays a crucial role in realizing this vision. There are\nfour key drivers for integrating generative AI into Web 3.0,\ni.e., truly bringing semantics to Semantic Web 3.0, efficiently\ndeveloping Web 3.0, easily performing data analysis, and\nproactively providing security assistance.\n1) Semantic understanding: Web 3.0 proposes a digital\nrealm where machines can interact and communicate with\nboth other machines and human users. However, in order for\nmachines to precisely and effectively communicate, they must\n15\nfirst understand the meaning and subtle differences of digital\ninformation. This is why generative AI will be the cognitive\nlayer of Web 3.0 as illustrated in Fig. 1, driving machines to\ncomprehend various types of content through DL algorithms.\nFor instance, text, audio, images, and video as shown in\nFig. 13. An increasing number of practical applications also\nhighlight the advantages of incorporating semantic capabilities\ninto the Web 3.0 ecosystem. For example, Alice is the first\nintelligent non-fungible token powered by GPT-3, allowing\nit to adjust how it interacts with people based on each new\ninteraction [102]. Pregelj in [103] introduces a ChatGPT-based\nWeb 3.0 plugin that enables wallet creation, on-chain queries,\nand on-chain operations directly from prompts. SuperCool AI\nis a digital marketplace based on generative AI that generates\nand trades NFTs via prompts [104].\n2) Efficient development: To realize the decentralized and\nintelligent vision of Web 3.0, SCs are indispensable because\nmost of the core applications and services in Web 3.0 are built\non SCs. These include the creation and trading of NFTs, the\ndevelopment of dApps in the DeFi field, and the formulation of\nDAO rules, etc. Generative AI can revolutionize the way SCs\nare created as they are essentially self-executing contracts with\nterms and conditions programmed directly into the codes. By\nunderstanding context and expected outcomes, generative AI\ncan advance the Web 3.0 ecosystem by efficiently developing\nSC code that ensures compliance with predefined rules. For\nexample, Web3-GPT is a chat assistant based on GPT4 that\ncombines LLMs and AI agents, aiming to revolutionize the\ndevelopment and deployment process of SCs [105]. ETHGPT\nis a development toolkit that supports semantic search to\nprovide professional tools and assistance to support the rapid\ndevelopment of the Web 3.0 ecosystem [106]. FlashGPT can\nefficiently generate and deploy secure and reliable Solidity SCs\nto a variety of Layer 1 and Layer 2 solutions through simple\ninteractions [107].\n3) Data analysis: In the user-centric Web 3.0 ecosystem,\ngenerative AI will play an important role in simplifying data\nanalysis. Through natural language interfaces, generative AI\ncan quickly and accurately analyze complex datasets based\non simple prompts from users, providing users with valuable\ninsights. In this way, generative AI eliminates the need for Web\n3.0 users to master relevant programming languages or ad-\nvanced data analysis knowledge by automating data processing\nbehind the scenes, lowering the barrier to participating in the\nWeb 3.0 economic ecosystem. For example, TokenGPT aims\nto simplify complex Web 3.0 investing by using generative\nAI to review SCs to conduct a comprehensive analysis of the\nmarket [108]. CoinGPT is a generative AI-driven data analysis\ntool that allows users to connect their crypto wallets to analyze\nthe transaction history of NFTs and other cryptocurrencies to\nimprove transaction performance [109]. Defi-Companion is a\nChatGPT-based bot that assists Web 3.0 users in querying data\nfrom endpoints, performing data analysis, and identifying DeFi\nopportunities [110].\n4) Security assistance: Security is critical to the Web 3.0\necosystem. The P2P architecture, consensus mechanism, and\ncryptographic protocol of blockchain technology provide the\nfirst level of security, preventing 51% attacks, double spends,\nSybil attacks, etc. However, these guarantees are not sufficient\nfor complex Web 3.0 systems. Various security and reliability\nissues may still arise. Generative AI is a promising solution\nthat provides additional protection for Web 3.0 users and their\ndata through continuous monitoring of SCs. For example,\nQuantstamp can secure transactions and build user trust by\nautomatically auditing SCs through generative AI to uncover\nvulnerabilities that may be missed by traditional methods\n[111]. ChainSecurity uses a combination of generative AI and\nformal verification methods to detect vulnerabilities in SCs\n[112]. Secure Semantic Snap, a ChatGPT-based MetaMask\nSnap, can semantically understand the target contract to protect\nusers from malicious SCs [113].\nD. Web 3.0 for generative AI\n1) Current solution of generative AI: Data and computing\npower are considered to be the two major elements that\npromote the development of AI. The development of these\ntwo elements has also become a booster for the explosion of\nAI technology. Based on the generative models, generative AI\ntypically requires a significant amount of computing power\nand data. This is due to the fact that generative AI models\nare built on intricate mathematical algorithms, which need to\nanalyze enormous datasets to recognize patterns and generate\nnew content. In addition, training these models is compu-\ntationally intensive, particularly for models that deal with\nhigh-resolution images or real-time processing. Today, LLMs\nare booming. However, the scale of LLMs has dramatically\nincreased which could be a major obstacle for the majority of\norganizations. The high computational demands also restrict\nits use in computing environments with constrained resources,\nsuch as mobile devices or edge computing systems.\nThe current solution is cloud computing, as it provides the\nnecessary computing resources and infrastructure required to\ndevelop and deploy chatbots at scale. Different chatbots can be\ndeployed on different cloud computing platforms, depending\non their specific needs and requirements. For example, Chat-\nGPT is running on Microsoft Azure while Bard is executing\non the Google Cloud platform. The cost of training such\nmodels is growing exponentially, which is unacceptable for\nmany organizations. Ultimately, the tech giants will continue\nto dominate the market for generative AI, meaning that the\nvalue generated by this phenomenal field will be drawn by\nthese large companies. This is still the typical way of operating\nin the Web 2.0 era, which is large-scale and highly centralized.\n2) Web 3.0 as a solution: In the trend of decentralization,\ncloud computing solutions represent a compromise for the\nemerging industry. Web 3.0 provides a decentralized coordi-\nnation platform that will facilitate unprecedented innovation\nand the adoption of generative AI. The enormous amount\nof data available for research, development, and industrial\nuse is one of the key factors enabling the rapid development\nof generative AI. Accordingly, relevant solutions in this area\nhave also received wide attention. For example, MedDAO is\nan innovative decentralized autonomous organization (DAO)\ndedicated to addressing the critical issue of the shortage\nof medical images in training AI models within the global\n16\nData Source\nData Sharing\nDecentralized\nComputing\nToken-based\nIncentives\nInterpretability\nWeb 3.0\nGenerative AI\nComputational \nPower\nWeb 3.0 Ecosystem\nDecentralized \nStorage\nData\nFig. 14. Web 3.0 reduces the requirements for generative AI development.\nhealthcare field. Specifically, MedDAO creates aggregated and\ndecentralized datasets by providing an anonymous, encrypted,\nand secure healthcare platform that incentivizes patients to\ncontribute personal data [114]. A data-driven economy makes\ndata the new gold. Correspondingly, computing power will\nbe an important tool for contemporary “gold diggers”. Under\nthe status quo of the technological monopoly of tech giants,\nthe Web 3.0 ecosystem will effectively promote the broader\ndevelopment of generative AI. Data-driven industries are no\nlonger just limited to large technology companies. Small-scale\ninstitutions and individuals will also benefit greatly, which is\nconsistent with the vision of Web 3.0. Generally, how Web 3.0\ncan solve the dual challenges of data and computing power\nfaced by generative AI can be elaborated from several main\naspects as shown in Fig. 14.\n• Decentralized storage: Web 3.0 infrastructure can provide\na more effective data storage solution. Instead of central-\nized servers, data can be stored on computer networks. In\naddition, there are technologies that allow for decentral-\nized data storage such as the IPFS. In this way, generative\nAI models can access data from various sources, reducing\nthe burden on individual computers and thereby assisting\nin solving the issues of data accessibility and availability\nfor generative AI that the existing system confronts.\n• Data provenance: Data provenance is a fundamental\nconsideration in generative AI as it creates new data from\nexisting data. Therefore, understanding the provenance of\nthe training data is critical to assessing the quality and\ntrustworthiness of the generated data. Web 3.0 enables the\ncreation of a tamper-proof record of data provenance and\ndata integrity. By ensuring that the data used to train AI\nmodels is trustworthy and comes from a reliable source,\nthe accuracy and quality of generative language models\ncan be improved.\n• Data sharing: Web 3.0 can effectively facilitate data\nsharing as it provides accountability and transparency\nregarding data access. Users will have absolute control\nover their data, as they possess ownership of their per-\nsonal data and digital identity through private keys that\nare exclusively under their control. Through protocols\nlike IPFS, users can choose which data to share and\nwith whom. Additionally, the network allows for secure\ndata sharing through technologies such as threshold secret\nsharing [115]–[117] and revocable data sharing [118]–\n[121]. This means individuals and organizations can\nshare data to jointly train generative AI models through\ncollaborative learning and secure multi-party computing\nschemes without compromising their privacy.\n• Decentralized computing: Web 3.0 enables decentralized\ncomputing through the use of blockchain networks. By\nleveraging the computing power of a network of decen-\ntralized computers, Web 3.0 can provide a more efficient\nand scalable computing environment for generative AI.\nIn this case, instead of relying on a single, centralized\nserver or data center to perform computational tasks,\nblockchain-based networks can distribute computational\ntasks across decentralized nodes coordinated by the Web\n3.0 platform.\n• Token-based incentives: Web 3.0 allows users to monetize\ntheir data using SCs. This is a key feature of Web\n3.0, where users can sell their data directly for profit\nwithout the involvement of third parties. Small companies\nand individuals will benefit from such a marketplace\nplatform as it removes barriers, levels the playing field,\nand promotes innovation. Additionally, idle computing\npower could also be sold. GPUs used for gaming are\ntypically utilized only a fraction of the time. Gamers can\nbid and receive payment for their idle computing power\nusing SCs. In this case, AI developers can utilize this\ncomputing power to train and deploy their models.\n• Interpretability: The interpretability of deep learning has\nlong been a bottleneck. Deep learning-based generative\nAI inherits this. Due to the dramatic increase in the size\nof language models, interpretability has become more\nimportant than ever. Web 3.0 allows all data processing\nand decisions to be tracked via blockchain. In turn, the\ngenerative paradigm of the data is analyzed in depth to\nachieve a constant understanding of generative AI and\nachieve effective control over it.\n17\nApplications\n of AI in \nWeb 3.0\nAnti-money Laundering [123]-[126]\nReputation System [122]\nFake News Detector [127]\nAnomaly Detection [128]\nOptimal Auction [129]\nAssets Recommendation [130]\nSocial Recommendation [131]\nFig. 15. Applications of AI in Web 3.0.\nE. Practical applications of AI in Web 3.0\nIn this section, we further explore the applications of AI in\nWeb 3.0 as shown in Fig. 15, to provide intuitions on how to\nleverage AI in the Web 3.0 ecosystem. Keizer et al. in [122]\nintroduced the need for a decentralized trust and reputation\nsystem on the Web 3.0 platform by discussing the trust issues\ncaused by Web 3.0’s distributed shared services. Specifically,\nthe paper proposed a framework based on deep reinforcement\nlearning that allows reputation scores to be calculated in a\ndecentralized manner while still being personalized for each\nuser. Lorenz et al. in [123] proposed an active learning so-\nlution to address the challenging problem of detecting money\nlaundering activities in cryptocurrency transactions when there\nis minimal labeled data available. Specifically, active learning\nwas applied to develop an efficient classifier to reduce the\nnumber of labels required. This is achieved through an iterative\nsampling strategy of the most informative, yet unlabeled\nexamples from the pool of data points. Weber et al. in [124]\nexplored the potential of using ML for the anti-money laun-\ndering of cryptocurrencies. The goal was to enable financial\nforensics by analyzing open data on blockchains despite the\nchallenges posed by the anonymity of cryptocurrencies. The\nmain contribution of this article was to open source the Elliptic\ndataset and provide benchmark methods to predict the binary\nclassification of illegal transactions. Alarab and Prakoonwit\nin [125] developed a classification model that utilizes a\ncombination of long-short-term memory (LSTM) and graph\nconvolutional network (GNN) to classify illicit transactions in\nthe Elliptic Bitcoin dataset based only on transaction features.\nBy studying different acquisition functions under the same\nexperimental settings, the proposed model could achieve an\naccuracy of 97.77%. Lo et al. in [126] proposed Inspection-\nL, a novel GNN framework for detecting money laundering\nactivities in the Bitcoin network. At its core, Inspection-\nL combined a self-supervised Deep Graph Infomax and a\nsupervised Random Forest to learn topological information\nand node characteristics within the transaction graph for the\npurpose of identifying illegal transactions. The framework\nshowed the potential for identifying suspicious financial activ-\nities. Unzeelah et al. in [127] proposed an AI-powered method\nto build a secure, reliable, and efficient platform in Web 3.0\nto address the issues of misleading content and fake news\nspreading on current platforms. To this end, NLP technologies\nand ML models were implemented. For example, LSTM\nwith Word2Vec and GloVe were used for word embeddings.\nAdditionally, the combination of the Ethereum blockchain with\nthe IPFS technique was utilized to decentralize the system and\nenable off-chain storage. Kim et al. in [128] presented a novel\nsecurity mechanism using blockchain network traffic statistics\nas a metric for identifying malicious events. Specifically, a data\ncollection engine periodically generated multi-dimensional,\nreal-time data streams by monitoring underlying blockchain\nactivities. Afterward, an anomaly detection engine was used\nto detect anomalies from the generated data instances based\non One-class Support Vector Machine or AutoEncoder. Xu et\nal. in [129] introduced a quantum blockchain-powered Web\n3.0 framework to provide information-theoretic security for\ndecentralized data transmission and payment to cope with the\nsituation that quantum computing subverts the conventional\ncryptosystems. In particular, an optimal auction for NFT\ntransactions based on quantum deep learning is proposed to\nmaximize revenue with sufficient liquidity in Web 3.0. Yu et al.\nin [130] proposed a framework for classifying referable non-\nfungible tokens (rNFTs) using GNN. The goal was to provide\nan effective recommendation system for Web 3.0 assets. First,\nthe authors converted rNFT reference relationships into direct\nacyclic graphs (DAGs). Then, the node and edge charac-\nteristics were modeled based on rNFT metadata and token\ntransactions. Afterward, GraphSage was modeled to contain\nthe characteristics collected during the learning process. In this\nway, the model combined considerations of graph topology\nand attribute characteristics to enable supervised classification\nof existing and incoming NFT nodes. Madhwal and Pouwelse\nin [131] implemented a decentralized social recommendation\nsystem, Web3Recommend, that aimed to generate balanced\nrecommendations for trust and relevance on Web 3.0 plat-\nforms. It addressed the challenges of generating recommen-\ndations in decentralized networks that lacked a central author-\nity and were vulnerable to Sybil attacks. Web3Recommend\ncombined MeritRank (a decentralized reputation scheme that\nprovides Sybil resistance) and SALSA (a personalized graph\nalgorithm). Specifically, MeritRank added decay parameters\nto SALSA to theoretically guarantee protection against Sybil\nattacks. By integrating with Music-DAO, an open-source Web\n3.0 music-sharing platform, the proposed system was shown\nto generate personalized real-time recommendations.\nF. Summary and insights\nWeb 3.0 is a user-centric web where users can create and\ntrade their digital assets. Generative AI and Web 3.0 have great\npotential to reinforce each other. On one hand, Generative\nAI lowers the barriers for ordinary users to enter the Web\n3.0 world through its powerful API. Its semantic understand-\ning capabilities allow users to easily create exclusive NFTs,\nproviding a solid foundation for participating in the digital\n18\neconomy. On the other hand, Web 3.0 can alleviate Generative\nAI’s huge demand for data and computing power. In this way,\nlightweight, personalized, and even decentralized generative\nAI will become possible. Despite these promising aspects, for\ngenerative AI to be effectively and securely integrated into\nWeb 3.0 environments, challenges around bias and lack of\nexplainability need to be addressed. Moreover, there is an\nurgent need for effective storage and computing solutions to\nsupport the sustainable development of Web 3.0.\nV. EDGE COMPUTING FOR WEB 3.0: AN\nINTERCONNECTED AND UBIQUITOUS WEB\nWeb 3.0 is expected to be an interconnected and ubiquitous\nweb that is accessible to everyone and anywhere at any time.\nWith the rise of IoT devices and the increasing need for low-\nlatency and real-time data processing, edge computing has\nbecome an important part of the Web 3.0 ecosystem. Edge\ncomputing is essentially a distributed computing paradigm in\nwhich computing services occur at the edge of the network\nas opposed to being performed in centralized data servers.\nUsers can benefit from faster service via edge computing by\nbringing computing resources and data storage closer to where\nusers actually consume the data.\nIn this section, we will first illustrate the close correlation\nbetween edge computing and Web 3.0. Then we will explore\nthe integration of edge computing and other cutting-edge tech-\nnologies to promote the development of Web 3.0. Specifically,\nwe proposed two solutions for decentralized storage and com-\nputing. Afterward, we will introduce the practical applications\nof edge computing in Web 3.0. Finally, the summary and\ninsights are provided.\nA. Relevance to Web 3.0\nWeb 3.0 is a network of ubiquitous connectivity that aims\nto create a collaborative platform that is accessible to anyone,\nanywhere, and anytime. The decentralized infrastructure of\nedge computing is highly compatible with this vision of Web\n3.0. Specifically, edge computing can support Web 3.0 in the\nfollowing aspects as shown in Fig. 16.\n1) Decentralized storage and computing: Edge computing\nplays a crucial role in facilitating decentralized storage and\ncomputing in the Web 3.0 ecosystem. Users are able to\nstore and process data in edge devices without relying on\ncentralized servers. This increases users’ control over their\ndata. In addition, edge computing can distribute storage and\ncomputing tasks across edge devices, making Web 3.0 more\nscalable and more resilient [132]. In this way, users can also\nshare or monetize their idle storage space and computing\npower on the Web 3.0 platform, which contributes to the\nrealization of data ownership and fair incentives in Web 3.0.\n2) Reduced latency: Edge computing can significantly re-\nduce the latency of Web 3.0 applications, improving the overall\nperformance of the Web 3.0 ecosystem. Edge devices can pro-\ncess data and perform tasks close to the data source, reducing\nthe need for network transmissions [133]. This is important\nfor Web 3.0 applications as they typically require real-time\ninteractions. With the proliferation of 5G, fast communication\nto distribute data and computing power across edge\ndevices, enhancing scalability and resilience\nDecentralized storage and computing: \nReduced latency:\nto process data and perform tasks close to the data\nsource, reducing the need for network transmissions\nEnhanced security and privacy: \nto minimize the need to interact with centralized\nservers by locally storing and processing data\nGreater availability:\nto enable resilient and accessible Web 3.0 via reduced\ntransmission distance, local data processing, etc.\nto reduce the usage of bandwidth and network\nresources, lowering the network costs\nHighly cost-effective: \nFig. 16. Relevance of edge computing to Web 3.0.\nwith edge devices has been greatly improved. Users can get\nfast responses from Web 3.0 applications running on edge\ndevices. Therefore, with the help of edge computing, the user\nexperience can be greatly enhanced, driving the widespread\nadoption of Web 3.0.\n3) Enhanced security and privacy: In the architecture of\nedge computing, the natural isolation of edge devices improves\nthe overall security and privacy of the Web 3.0 ecosystem. In\nedge computing, data is stored and processed locally on edge\ndevices, minimizing the need for data to travel to and from\ncentralized data servers. This reduces the risk of data being\ncompromised during transmission. In addition, distributed data\nstorage and processing across a wide range of edge devices\nprotects data from a single point of failure. As data is frag-\nmented and stored on multiple edge devices, an attacker would\nneed to simultaneously compromise a significant number of\ndevices to access or tamper with the information, which\nis challenging. For example, in the well-designed Web 3.0\necosystem with Byzantine fault tolerance, an adversary might\nneed to corrupt more than 33% of the devices to attack the\nsystem. Otherwise the Web 3.0 ecosystem can continuously\nprovide services. Moreover, since data is stored and processed\non edge devices, without being collected by the centralized\ndata servers, data privacy can be enhanced.\n4) Greater availability: The Web 3.0 ecosystem needs to\nfunction regardless of connectivity. The architecture of edge\ncomputing can provide the resilience to prevent a single point\nof system failure. In addition, edge computing allows data\nto be stored and processed locally on edge devices close to\nwhere the data is generated. This can significantly shorten the\ndistance of data transfer. Moreover, edge computing allows\nlocal edge devices to perform data preprocessing, content\ncaching, and load balancing. This reduces the amount of\ndata that needs to be transferred over a constrained network.\nThese three aspects improve the availability of the Web 3.0\necosystem as well as the accessibility of its applications.\n5) Highly cost-effective: Mass adoption of Web 3.0 will\nbenefit from a variety of applications. Edge computing pro-\n19\nvides a more cost-effective solution for application develop-\nment and deployment by allowing businesses or individuals to\nutilize edge devices. Specifically, edge computing enables the\nutilization of existing client devices, thereby eliminating the\nrequirement for costly infrastructure. As such, the development\nof edge applications requires less upfront equipment invest-\nments and deployment time. Moreover, with edge computing,\nbusinesses can optimize their IT costs by processing data\nlocally rather than in the cloud or large data centers [134],\n[135]. In the Web 3.0 ecosystem, enterprises will benefit from\nutilizing edge computing infrastructure to reduce dependence\non cloud providers, resulting in lower workloads and faster\ncontent delivery. For example, MadeiraMadeira, a leading\nBrazilian retailtech, has significantly reduced its operating\ncosts by offloading up to 90% of transmitted data to edge\ncomputing resources [136].\nB. Integration of edge computing and blockchain: a storage\nsolution for Web 3.0\nEdge computing and blockchain are separate but inter-\ndependent technologies in Web 3.0. Edge computing can\nprovide the infrastructure for blockchain nodes to store and\nverify transactions. Blockchain, on the other hand, can be\ntruly decentralized by creating an open and secure computing\nenvironment. Since both edge computing and blockchain are\ndeveloped based on the concept of decentralized and dis-\ntributed networks, they can become a powerful combination\nby complementing each other [137], [138]. The main benefit\nof this combination is that it enables secure communication\nand data processing, including data storage and computation,\nwithout the need for centralized servers. In this section, we\nwill discuss in-depth how the integration of edge computing\nand blockchain can provide a decentralized storage solution\nfor Web 3.0 applications that require high performance, low\nlatency, secure, and decentralized storage. Specifically, we will\nfirst introduce the main building blocks. Then, we will parse\ntheir functionalities to propose an edge storage solution.\n1) Building blocks: The proposed decentralized storage\nsolution consists of four main functional modules: network\narchitecture, incentive mechanism, data integrity, and access\ncontrol. These modules play a vital role in ensuring the\neffectiveness and security of the storage system.\n• Network architecture: Edge nodes act as storage nodes\nwhile edge devices act as data centers. These edge nodes\nare registered on the blockchain network in a specific\nway to provide excess storage space that can be used by\nthe storage network. For example, a deposit is required\nto complete registration on the Ethereum network. When\ndata needs to be stored, the data is distributed to avail-\nable edge nodes for redundant storage. The reliability\nof storage is guaranteed by the blockchain-based token\nsystem. Blockchain networks run in parallel to act as\nadministrators. Data is hash-mapped to corresponding\nedge node locations for tracking and maintenance. In\naddition, the blockchain strictly enforces the access con-\ntrol mechanism and verifies the integrity of the data.\nIncentives are made by tracking and monitoring the\namount of storage provided by each edge node and the\nintegrity of the data. Users and dApps interact with the\nstorage network through APIs that communicate with\nthe blockchain network. Specifically, edge nodes provide\na decentralized storage layer. Blockchain manages the\nstorage network and enforces policies. The API acts as\nthe interface between users and dApps. The key is that\nthis architecture combines the advantages of blockchain\nwith the distributed resources of edge computing.\n• Incentive mechanism: An important component of this\nstorage solution is the incentive mechanism that rewards\nedge nodes for providing storage. An effective incentive\nmechanism can solve the information asymmetry problem\nbetween users and the network [139]. When an edge node\ninitially registers to join the network, it needs to deposit a\ncertain amount of tokens. The deposited amount depends\non the amount of storage that the edge node wishes to\nprovide. This ensures that edge nodes are committed to\nproviding reliable and accessible storage. If an edge node\ndoes not do as promised, it will lose the deposited tokens.\nOn the other hand, edge nodes can obtain corresponding\nrewards by meeting certain conditions. For example, they\nprovide the amount of storage promised at registration\nand keep that storage accessible. They also need to\nregularly verify data integrity.\n• Data integrity: Blockchain verifies the integrity of data\nby maintaining hash values. When data is uploaded to\nthe storage network, SC is responsible for distributing\nit to available edge nodes. Specifically, edge nodes first\nhash the data to generate a unique hash value. Then, the\nhash value and corresponding metadata will be recorded\non the blockchain. Notably, edge nodes must periodically\nprovide hash values of the data to prove that they have the\ncorrect version of the data. In this way, it can be ensured\nthat the data stored on the edge nodes matches the original\ndata uploaded to the storage network. If an edge node\nfails to provide the correct hash value, it will be tagged\nas an invalid storage node. Users can choose whether to\ndownload the required data according to the latest tag.\nThe downloaded data is hashed locally using the same\nalgorithm (i.e., SHA256). This local hash value is then\ncompared to the hash value stored on the blockchain. If\nthe hashes do not match, the data has been corrupted or\nmodified. Users will need to re-download the required\ndata from other edge nodes. In this way, even if some\nedge nodes are offline, users can obtain the correct data\nwith the help of the original hash value stored on the\nblockchain.\n• Access control: As a Web 3.0 storage solution, the\nblockchain does not exist as a database but is used as\na decentralized and immutable ledger. Data ownership,\naccess rights, and decryption keys are all recorded on\nthe blockchain. A large number of edge devices serve as\nactual storage units. At this point, the encrypted data is\nstored on the edge device, while the decryption key is\nmanaged by the blockchain. When a user requests access\nto the data, the blockchain is first responsible for checking\nwhether the user has the appropriate permissions. Access\n20\ndApp\nAPI\nEdge nodes\nSmart contract\nLedger\nEdge\nstorage\n1. register\n2. require deposit\nBlockchain\n3. provide storage\n4. hash data\n5. verify data\nEdge\nstorage\nEdge\nstorage\n6. provide hash\n7. request data\n8. lookup access rights\n9. check access rights\n10. provide decryption key\n11. request data\n12. return encrypted data\n13. decrypt data\n14. record access log\nFig. 17. A decentralized storage solution in Web 3.0.\nrights can also be further divided and enforced by the\nblockchain. For example, a small number of designated\nusers can read and write data, while other users can only\nread data. In addition, access rights can be restricted to\naccess only specific parts of the data, rather than the entire\ndataset. Authenticated users will be given the appropriate\ndecryption key to access the data. The blockchain dis-\ntributes the decryption keys only to users with appropriate\naccess rights. In this case, only authorized users with\nthe correct decryption key can access the data. This\nensures that even if an edge node is compromised, data\nremains secure without proper keys. Moreover, activity\nlogs of access attempts, key distribution, and successful\naccess are recorded in the immutable ledger so that any\nunauthorized access attempts can be detected.\n2) A decentralized storage solution: The proposed frame-\nwork (see Fig. 17) aims to provide decentralized, secure,\nreliable, and low-latency storage by utilizing the integration of\ndistributed edge resources with blockchain technology. Edge\nnodes first register on the blockchain network. As part of\nthe registration process, edge nodes must post a deposit of a\ncertain value to signify their commitment to providing storage\nresource services. A blockchain-based token incentive system\nis used to reward edge nodes for reliably contributing their\nstorage. When storing data, edge nodes initially hash the data\nthrough a cryptographic hash function, such as SHA256, to\ngenerate a unique identifier. Edge nodes are then responsible\nfor periodically verifying data integrity by comparing hash\nvalues. The latest hash is submitted to the blockchain network\nfor review and modification, in order to ensure only valid\ndata hashes are maintained. This allows data reliability and\nintegrity to be guaranteed even if some edge nodes become\nunavailable. Additionally, the blockchain network is used to\nmanage access control, decryption keys, and access logging\nin a decentralized manner. Specifically, when a dApp requests\ndata through the API, the blockchain uses predefined SCs to\ncheck whether it has the appropriate access right. If authorized,\nthe blockchain will provide the decryption key to the API. The\nAPI then requests data from the specified edge node which will\nreturn encrypted data. At this point, the API can use the key\nto decrypt the encrypted data and provide the plaintext to the\nuser. Afterward, the blockchain records an immutable log of\nthe access.\nC. Integration of edge computing and AI: a computing solu-\ntion for Web 3.0\nThe convergence of edge computing and AI is known as\nedge AI, where AI models are deployed and executed at the\nedge of the network, close to where the data is generated\n[140]–[142]. Edge AI is a promising combination for enhanc-\ning the functionalities of Web 3.0. With edge AI, edge devices\ncan perform data analysis locally, without relying on tradi-\ntional centralized servers. In this way, Web 3.0 applications\nthat require high-speed data processing can give fast responses\nto complex environments. For example, edge AI can power\nedge devices such as robots, drones, and self-driving cars that\nrequire real-time analysis of sensor data. Edge AI can also\nimprove the privacy and security of Web 3.0 applications by\nprocessing data at the edge device. In addition, the architecture\nof edge computing is distributed and redundant, the Web 3.0\nsystem can continue to operate even if some edge nodes are\ndamaged or offline. All of these characteristics are highly\ncompatible with the Web 3.0 vision. In this section, we will\nproceed to explain how edge AI can provide a decentralized\ncomputing solution for the Web 3.0 ecosystem. Specifically,\nwe will first introduce the main building blocks. Then, we will\nuse a sequence diagram to demonstrate the proposed edge AI-\nbased decentralized computing solution.\n1) Building blocks: The proposed decentralized computing\nsolution consists of five core components: network deploy-\nment, model deployment, incentive mechanism, collaborative\nlearning, and communication-efficient protocol. They are de-\nsigned to function in an integrated manner to facilitate efficient\nand effective edge operations.\n• Network deployment: The first step is to deploy an edge\nnetwork consisting of a large number of edge devices.\nEdge devices refer to any machines at the edge of the\nnetwork that can perform specific tasks. For example,\nvarious types of IoT sensors, edge servers, smart devices,\nand so on. Specifically, IoT sensors are responsible for\ncollecting data from the surrounding environment. Edge\nservers are designed to aggregate data from multiple\nIoT sensors and perform computations accordingly. Smart\ndevices can both collect and process data.\n• Model deployment: Through the edge network, AI mod-\nels can be deployed to edge devices as needed by Web 3.0\n21\nEdge devices\n1. collect/process data\nEdge AI \nmodels\nComputing \ntasks\nGlobal model\nWeb 3.0\ndApps\nCommunication\nIncentives\n2. deploy models\n3. perform computing tasks\n4. train local models\n5. exchange parameters\n6. update global model\n7. continuous learning\n8. optimize protocols\n9. establish rewards\n10. participate\n11. provide updates\nEdge devices\nEdge AI \nmodels\nComputing \ntasks\nGlobal model\nWeb 3.0\ndApps\nIncentives\nCommunication\nFig. 18. Workflow of a decentralized computing solution in Web 3.0.\napplications. These AI models can perform various tasks\nsuch as CV, NLP, and predictive analytics. Specifically,\nCV models can be deployed on edge devices such as cam-\neras and IoT sensors for object detection and recognition.\nNLP models can be used to perform language-related\ntasks on smart devices. Predictive models can analyze\nreal-time data streams from IoT sensors for anomaly\ndetection and predictive maintenance.\n• Incentive mechanism: A proper incentive mechanism is\nsignificant for developing decentralized computing solu-\ntions in the Web 3.0 ecosystem. Owners of edge devices\nwill have an incentive to participate and share their data\nand computing resources, driving more effective edge AI-\nbased computing solutions. Rewards can be offered in a\nvariety of ways. For example, owners of edge devices and\ndata contributors can be rewarded with tokens for sharing\ndata and resources. In the decentralized community, they\ncan also gain a higher reputation, such as badges and\nrankings, for the quantity and quality of data and re-\nsources they provide, thereby unlocking more community\nservices.\n• Collaborative learning: Collaborative learning is funda-\nmentally a decentralized form of learning, which matches\nthe decentralized nature of Web 3.0. In the context of\nedge AI, each edge device can train a local model based\non the local data. Then honest edge devices within the\nedge network collaborate and share parameters to create\na more general global model. Since there is no central\nauthority, edge nodes can exchange learning parame-\nters through peer-to-peer communication to optimize the\nglobal model. Furthermore, collaborative learning can\nhelp improve the global model by combining data from\nmultiple data resources without sharing the original data.\n• Communication-efficient protocol: Communication over-\nhead is often the bottleneck in distributed systems. The\nperformance of a distributed system is usually measured\nby the communication complexity. Communication com-\nplexity refers to the amount of data that needs to be com-\nmunicated in the form of bits or messages between edge\nnodes in the network. Reducing communication complex-\nity is critical to the scalability, bandwidth requirements,\nand network latency of the Web 3.0 ecosystem. There\nare several ways to significantly reduce communication\noverhead. First, the most fundamental way is to de-\nvelop communication-efficient decentralized algorithms.\nSecond, priorities can be assessed based on the incentive\nmechanism. In this way, the model parameters provided\nby edge nodes or devices with high priority will be\nadopted. Finally, limiting the frequency of model updates\nis also a straightforward way to reduce communication\noverhead. For example, changes in model parameters of\nedge nodes or devices only trigger communication when\na certain threshold is reached.\n2) A decentralized computing solution:\nAs shown in\nFig. 18, deploying edge AI models can process data efficiently\nand effectively. This eliminates the need for extensive data\nexchange with centralized servers and provides real-time feed-\nback to perform tasks such as object detection using computer\nvision or malware analysis using LLMs. Edge devices train\nlocal models using their own data and share parameters with\nthe global model. This sharing enables the global model\nto be continuously improved through collaboration, creating\n22\nApplications \nof Edge\nComputing in\nWeb 3.0\nResource\nManagement\n[143]\nSurveillance\nSystem\n[144]\nHealthcare\nSystem\n[133]\nFig. 19. Applications of edge computing in Web 3.0.\na positive loop ecosystem. Optimization of communication\nprotocols is critical to creating decentralized ecosystems where\ndata and resources may be limited, as they allow efficient shar-\ning of parameters between edge devices and global models.\nBy optimizing communication, the communication overhead\nof edge devices is mitigated, making it easier for them to\nparticipate and contribute to the growth and improvement of\nthe global model. The incentive mechanism creates a mutually\nbeneficial relationship that can further encourage edge devices\nto share resources and strengthen the global model to support\nvarious applications in the Web 3.0 ecosystem.\nD. Practical applications of edge computing in Web 3.0\nIn this section, we further explore the applications of edge\ncomputing in Web 3.0, as shown in Fig. 19, to provide\nintuitions on how edge computing can be used in the Web\n3.0 ecosystem. Singh and Chatterjee in [133] proposed a\nsmart healthcare system based on edge computing, aiming\nto address the challenges posed by the growing number of\nsensitive patient data faced by modern healthcare systems. The\nproposed system incorporated an intermediary edge comput-\ning layer tasked with preserving low latency and protecting\npatient privacy. This edge computing layer was used to en-\ncrypt and handle patient data privacy by applying Privacy-\nPreserving-Searchable-Encryption techniques. Additionally, an\naccess control mechanism was also implemented by the layer\nto restrict unauthorized access to patient data stored remotely.\nCompared with traditional methods, the proposed approach\nshows improvements in performance, security, lower latency,\ntransmission time, power consumption, and energy consump-\ntion. In the Web 3.0 ecosystem, no single entity can control\nlarge volumes of resources. Therefore, resource collaboration\nand management have become particularly important. As a\npromising solution, edge computing has the potential to max-\nimize individual benefits through resource allocation mecha-\nnisms. Luong et al. in [143] presented a DL-based approach\nfor deriving an optimal auction mechanism to coordinate\nedge resources in a decentralized environment. Specifically,\nminers’ valuations were used as training data to model deep\nneural networks for the purpose of performing monotonic\ntransformations on miners’ bids. Wang et al. in [144] proposed\na video surveillance system based on the integration of edge\ncomputing, permissioned blockchain, IPFS technology, and\nTABLE III\nMAIN DIFFERENCES BETWEEN WEB 3.0 AND METAVERSE.\nAttributes\nWeb 3.0\nMetaverse\nDefinition\na new version of Web\ndigital reality\nFocus\nownership\nexperience\nInterface\nfront-end\nVR/AR\nArchitecture\nfully decentralized\ncentralized/decentralized\nKey technology\nblockchain/AI\nextended reality\nCNNs. The goal was to address challenges that commonly\narise within large-scale video surveillance, such as massive\ndevice access, high bandwidth requirements, vulnerabilities\nto attack, and real-time monitoring. Respectively, the system\nused edge computing to facilitate extensive wireless sensor\ninformation gathering and data processing in a distributed\nmanner. Permissioned blockchain underlain the framework to\nensure reliability and robustness. IPFS technology was used\nfor massive video data storage to reduce bandwidth usage.\nCNN technology permitted object recognition capabilities\nwithin video streams, achieving real-time surveillance.\nE. Summary and insights\nThe exponential growth of the IoT has resulted in billions\nof devices being deployed around us. These edge devices are\nincreasingly becoming the foundational carrier for supporting\nWeb 3.0, generating massive amounts of heterogeneous and\nconfidential data. In traditional centralized architectures, it is\neasy to unify and coordinate real-time data processing, com-\nputation, and decision-making. However, in a decentralized\nWeb 3.0, this task becomes extremely challenging. Especially\nas centralized solutions mature, the efficient allocation of re-\nsources for storage and computation in the Web 3.0 ecosystem\nneeds to be further optimized. In addition, the development of\nlightweight multimodal learning algorithms for edge devices\nis essential for edge resource management and optimization in\nWeb 3.0 scenarios.\nVI. USE CASES FOR WEB 3.0\nAlthough Web 3.0 is still in its emerging stage, it has a solid\ntechnological foundation. Blockchain, AI, and edge computing\nwill enable Web 3.0 to play an important role in various fields.\nNotably, when it comes to Web 3.0 applications, Metaverse\nmay come up in the discussion. However, Metaverse is con-\nsidered to be a different kind of web state than Web 3.0. The\nmain differences between Web 3.0 and Metaverse are provided\nin Table III.\nMetaverse is a gigantic and shared virtual space created\nwhen the physical world converges with the virtual world.\nAs opposed to Web 3.0, which is primarily concerned with\nwho will own and govern the Web, Metaverse focuses on\nhow people will interact with it. Moreover, people may still\nbrowse the Web using the front ends of various end devices for\n23\n6) showcase NFT\n5) load NFT\n5) load NFT\n6) showcase NFT\n7) offer bid (1 ETH)\n7) offer bid (1.5 ETH)\n9) own NFT\nDAO\ncoded into\nBuyer 1\nBuyer 2\nDApp in DeFi marketplace\nExchange \nsmart contract\nIPFS\nIPFS\nMint\nsmart contract\n1) upload data\n1) upload data\n2) mint NFT\n2) mint NFT\n4) list NFT\n4) list NFT\n8) accept highest bid\nSeller\n3) store NFT\n3) store NFT\nFig. 20. NFT trading process monitored by the DAO in the DeFi market.\nWeb 3.0. However, Metaverse users will access the Web using\nvirtual reality headsets while navigating a digital avatar across\nthe virtual environment. If Metaverse manifests, it may do so\nin a centralized manner (e.g., Meta) or decentralized manner\n(e.g., Decentraland), or in any combination of the two [145]–\n[147]. Although there is a lot of overlap in the technology\nsupport for Web 3.0 and Metaverse, Web 3.0 relies more on\nblockchain, AI, and some other emerging technologies while\nMetaverse relies on extended reality technologies such as\nvirtual reality (VR), augmented reality (AR), and mixed reality\n(MR). Therefore, even though the two concepts of Web 3.0 and\nMetaverse are highly related, the overlap does not necessarily\nmean that either is an application of the other. Metaverse\naims to correlate the digital and physical worlds so that social\nlife, the real economy, and physical identity can all find their\ncounterparts in the virtual world. Web 3.0 incorporates many\nsimilar features and characteristics but is distinguished by\nits focus on decentralization, trustless, permissionless, and\nindividual data ownership.\nIn this section, we will introduce three use cases in Web 3.0,\ni.e., NFTs, DeFi, and DAO. Firstly, we will show how they\ncan work together through a specific NFT trading process as\nshown in Fig. 20. Next, we will discuss these three main use-\ncases in terms of definition, relationship to blockchain and AI,\napplications, and corresponding issues.\nA key criterion for successful NFT trading is decentral-\nization, which enables trustlessness and security. To achieve\nthis, the entire trading process must be carried out by SCs\ndeployed on the blockchain. Furthermore, exchange contracts\nare designed to interact with all other NFT exchange contracts,\nwhich implies a widely adopted and recognized standard\ninterface (e.g., ERC-721) should be used. Additionally, a DAO\nshould be coded into the exchange SC such that users can\ncollectively manage the trading process. Notably, the exchange\nSC does not store NFT data itself, rather it only maintains\ninformation required to perform the transfer of ownership\n(e.g., NFT token ID, seller address, and buyer address). The\nactual NFT data is retrieved from a separate SC dedicated to\nminting the NFT. Specifically, the seller first uploads data to\na decentralized database (e.g., IPFS) in order to subsequently\nmint the corresponding NFT. Mint SC then retrieves data and\nuses it to mint NFT. Minted NFT will also be stored in the\ndecentralized database and listed through the Exchange SC.\nOn the buyer side, they send requests to Exchange SC to load\nNFTs and provide offers. Typically, the seller will accept the\noffer with highest bid. To accomplish this, Exchange SC will\ntransfer the bid to the seller and NFT ownership to the buyer.\nA. NFTs\n1) What is an NFT? An NFT is a token that represents a\nunique digital asset. It can be used to represent ownership and\nauthenticity. The assets cannot be exchanged with one another\nsince each person has a digital signature, making them distinct\nand non-interchangeable [148].\n2) Blockchain for NFTs: NFTs are minted through SCs de-\nployed on the blockchain, which determines the characteristics\nof the NFTs. The main features are listed below [149]–[152].\n• Ownership: Ownership depends on where the private\nkey associated with the NFT is stored. The transfer of\nthe private key is the replacement of ownership, which\nrealizes the trading of NFTs.\n• Scarcity: Each NFT has a unique ID, making it a scarce\nand non-fungible asset. Therefore, the certificate of own-\nership can be used across the network, enabling the owner\nto be effectively verified.\n• Interoperability: Users are allowed to seamlessly trade or\nshare NFTs across multiple blockchain-based ecosystems,\nincreasing the liquidity and reach of NFTs.\n• Immutability: The creation of an NFT means that the\nownership and provenance of the NFT, as well as any\nrelated data or metadata, are permanently stored on the\nblockchain and cannot be changed.\n• Programmability: The ownership and logic of NFTs can\nbe programmed through SCs. This allows more complex\nfunctionality, such as transfer rules and scarcity, to be\nencoded directly into SCs.\n• Transparency: Blockchain provides an immutable and\ntransparent record of ownership, attributes, and SCs\nassociated with NFTs. In this case, the integrity and\nprovenance of unique digital assets can be ensured.\nIt is worth noting that an NFT can only have one owner\nat a time. This owner can add more attributes related to the\nasset in the NFT. The public ledger can be viewed by anybody,\nmaking it simple to verify and trace an NFT’s ownership. In\n24\nthis way, creators can monetize their work, trade it globally,\nand have indisputable rights over their creations.\n3) AI for NFTs: AI and NFTs have a symbiotic relationship.\nAI greatly enhances NFTs through scarcity, personalization,\nand market optimization. In turn, NFTs provide a way to\nrecord, verify, and potentially monetize AI’s contributions.\nTogether, they are transforming collecting, creativity, identity,\nwork, and value. Specifically, there are a variety of ways that\nAI can be used in the context of NFTs.\n• Originality: In art, generative AI models can be used\nto generate new ideas and designs by studying large\ndatabases of human-created artwork. This is especially\nuseful for creators who want to issue large numbers of\nNFTs quickly.\n• Verification: Blockchain is used to establish proof of\nownership of NFTs. AI can play a complementary role\nby using techniques, such as fingerprinting, metadata\nanalysis, and content matching, to further verify NFT\nownership claims on blockchains.\n• Enhanced interactivity: AI-powered NFT can leverage\ndeep learning methods to make the tokenized assets more\ndynamic and interactive. The owner of NFTs can program\nto respond to certain commands or generate new designs,\nallowing the output of tokenized assets to evolve.\n• Optimization: AI can provide valuable insights into pric-\ning, improving liquidity, and maximizing the value of\nNFT by analyzing historical sales data and attributes\nof successful NFT, especially for items, collections, and\nassets with limited supply.\n• Personalization: AI provides personalized recommenda-\ntions about purchasing or collecting new NFTs by analyz-\ning a user’s collection, interests, and preferences, leading\nto a more curated and valuable collection.\n• Wider ecosystem: AI can be used to analyze the NFT\nmarket and forecast trends and demands, helping in-\nvestors and collectors make more informed decisions\nwhen trading NFTs.\n4) Applications for NFT: In this section, we will explore\nvarious notable applications of NFTs, that showcase how\nblockchain and AI technologies can drive the advancement\nof NFTs.\n• Securechain: Securechain is a hybrid verification system\ndesigned to protect NFTs stored in hot wallets from\nwallet-draining attacks [153]. The main idea is that with\na hybrid system, transfer verification can be created on-\nchain and accepted or rejected off-chain, unlike current\nsolutions such as transferring NFTs to cold wallets.\nIt needs to be made clear that cold wallets make it\ninconvenient to use NFTs. In addition, since the pri-\nvate keys of hot wallets cannot be changed, once the\nkey is compromised, users will be responsible for all\nresulting losses. In terms of specific implementation,\nthere are various security measures such as authentication\ncontroller, contract controller, authority controller, user\ncontroller, and verification controller. Additionally, the\nevent listening module allows the backend to monitor\nSC for any on-chain changes. All these functionalities\nare designed to ensure that the backend only accepts\nverifications, but strictly prohibits any changes to the\nverified information, as this information is permanently\nrecorded in the blockchain ledger.\n• NFTool: NFTool is an NFT platform powered by a suite\nof tools including a chatbot, an NFT minting tool, SC\nauditor, NFT search, and built-in NFT deployment [154].\nSpecifically, a ChatGPT-style chatbot that serves as an\nintelligent guide capable of handling related cross-chain\nfunctions and issues. To avoid creative concepts remain-\ning un-minted, users can follow the detailed instructions\nof Mint NFT to launch their own NFTs on different\nchains. However, errors in SCs can be easily exploited by\nmalicious actors. It is crucial to utilize the SC analysis\ntool to ensure SCs are tested thoroughly and ready for\ndeployment. In addition, the NFT Search tool enables the\nexploration of NFT collections across the blockchain by\nutilizing Covalent, Zora, and Graph. Users can convert\nfiat currencies into corresponding cryptocurrencies to\nhelp deploy SCs.\n• StoryChain: StoryChain is a new interpretation of story\nediting, leveraging Artificial Intelligence Generated Con-\ntent (AIGC) and blockchain technology to enable col-\nlaborative story creation [155]. With StoryChain, users\ncan collaboratively craft stories comprising distinctive\nchapters and artistic works. Notably, each page is an\nNFT minted for the corresponding user. During the story\ncreation process, the contract first verifies the appropri-\nateness of the user prompt, then ChatGPT generates the\ntext and illustrates it with an AI image generator. The\nentire story, along with the resulting images, will then\nbe uploaded to IPFS. The generated hash is submitted\nto the contract to mint the NFT for the author. This\nway, authors will have a permanent record of ownership\nand chapter details accessible on-chain via IPFS. Alterna-\ntively, a voting mechanism allows the story community\nto democratically select the direction of future entries,\ntreating each story like a DAO. The proposed chapter is\nsubject to consensus among NFT owners to determine the\ndirection of the story.\n5) Issues: Items that typically end up lost on the Web can\nnow be monetized through NFT technology. However, both\nthe NFT technology and the NFT market are currently in their\ninfancy. Critical infrastructure, including technology platforms\nand trading platforms, will continue to exist in a centralized\nform. We list the main issues from both technical and non-\ntechnical perspectives in Table IV [149], [150], [156]–[158].\nB. DeFi\n1) What is DeFi? DeFi manages financial services primarily\nusing blockchain technology and a number of cryptocurren-\ncies. It is an alternative to the global financial system of\nthe Web 3.0 era and aims to democratize finance, which is\ndifficult to achieve in the traditional financial system [159]–\n[162]. The biggest difference between DeFi and traditional\nfinancial institutions is that DeFi is decentralized and does\nnot use a third party to carry out financial operations. DeFi is\n25\nTABLE IV\nISSUES OF NFTS.\nTypes\nDescription\nTechnical\nComplexity\nThe complex development of NFTs has not yet been simplified by high-quality tools.\nStorage\nThe URL where the artwork is stored makes the artwork itself vulnerable to link damage.\nFees\nArtists pay more on average in the NFT market than they earn in sales.\nSC risks\nSC vulnerability caused a massive attack leading to the NFT theft incident.\nRapid innovation\nThis creates a challenge of continuous change for those who adopt the technology.\nUsability\nSlow confirmation and high gas prices will limit the rapid growth of NFTs.\nExtensibility\nIt is difficult to interact with other ecosystems.\nCybersecurity\nIt is challenging to identify fake NFT stores and malicious proxies.\nSecurity and privacy\nNFT data is at risk of being lost or misused by malicious parties.\nOthers\nRegulatory\nNew technologies bring unique regulatory and legal considerations.\nEnvironmental concerns\nTransactions result in high energy consumption and consequent greenhouse gas emissions.\nAnti-money laundering\nDecentralized transactions can lead to money laundering.\nCopyright\nThe public nature makes it easy for anyone to copy the referenced documents.\nPonzi scheme\nCritics have likened NFT to a Ponzi scheme.\nopen and transparent and performs a range of functions based\non the issuance code, which cannot be modified by any node\nand can only be updated if necessary with the consent of most\nnodes on the chain. A more detailed comparison of several key\naspects is shown in Table V [163], [164].\n2) Blockchain for DeFi: Blockchain is the core technology\nthat replaces traditional centralized institutions and enables\ndecentralized financial services as shown in Fig. 21 [165],\nTABLE V\nDIFFERENCES BETWEEN DEFI AND TRADITIONAL FINANCE.\nAttributes\nDeFi\nTraditional finance\nInfrastructure Decentralization\nCentralization\nCustody\nUsers\nCompanies\nCurrency\nDigital asset\nFiat currency\nSpeed\nMinutes\nDepends (manual processing)\nAuditability\nAnyone\nAuthenticated organizations\nCollateral\nRequired\nOptional\nAnonymity\nYes\nNo\nPermission\nNo\nYes\nAvailability\nYes\nNo\nTransparency\nYes\nNo\n[166]. Cryptocurrencies, SCs, stablecoins, and dApps are the\nfour components that comprise DeFi and are all based on\nblockchain technology [167].\n• Cryptocurrency: As one of the earliest and most suc-\ncessful deployments of blockchain, cryptocurrencies are\nubiquitous in the decentralized world. It has underpinned\nthe rise and continued success of DeFi. DeFi’s successful\noperation requires the support of cryptocurrencies be-\ncause they enable many core functions. For example,\ncryptocurrencies are used to represent and transfer value.\nWithout cryptocurrencies, basic lending and borrowing\nfunctions would not be possible.\n• SCs: As a blockchain-based program, a SC can be ac-\ntivated automatically when certain criteria are met. It\neliminates third parties or central authorities typically\nrequired in traditional financial transactions. It also allows\nusers to program any transaction into code, decentralizing\nthe financial process. When a SC goes live, no one\ncan change it. As a result, many of the business terms\nfound in traditional financial industry agreements can be\ntransferred to SCs and enforced through code.\n• Stablecoins: One of the main drawbacks of many cryp-\ntocurrencies is their excessive volatility, which greatly\nreduces the incentive to participate for those users who do\nnot have sufficient risk tolerance. To solve this problem,\nthe concept of stablecoins was created. A stablecoin is a\ncryptocurrency with a fiat stable price. It is designed to\nmaintain price parity with a stable asset, such as the US\ndollar or gold, to provide the necessary stability.\n• dApps: A dApp is essentially an application that runs\n26\nBorrowing\nand lending\nData\ninsurance\nDigital\nPayment\nPortfolio\nmanagement\nidentity\nStable\ncurrencies\nanalytics\nsolutions\nDecentralized\nDecentralized\nexchanges\nBuying\nderivatives\nDecentralized\norganizations\nInfrastructure\ntooling\nPrediction\nmarket\nFinancial Services\nBlockchain platform\nEthereum Virtual Machine (Ethereum, Solana, etc.)\nCryptocurrency\nSmart contract\nStablecoin\ndApps\nFrontend\nWallets\nFig. 21. DeFi stack.\non the blockchain. Unlike traditional applications that\nrun on large servers, dApps are created and deployed on\nthe blockchain through SCs. The main benefits are their\npermissionless nature and resistance to censorship.\n3) AI for DeFi: DeFi aims to democratize finance to bridge\nthe limitations of traditional finance. It can provide financial\nservices to anyone, anywhere, regardless of location, income,\nor background [168]–[170]. With the rapid and widespread\ndeployment of AI in multiple fields, AI is promising to provide\nnovel solutions to enhance the DeFi ecosystem [171], [172].\nSpecifically, it can be reflected in the following aspects.\n• Fraud Detection: AI can analyze transaction data, user\nbehavior, and transaction patterns to detect anomalies that\nmay indicate fraud, scams, or money laundering in DeFi’s\nplatform and protocols. Take money laundering as an\nexample, various techniques have been proposed to detect\nmoney laundering activities (see Section IV-E).\n• Risk Analysis: AI can assess the risks of different DeFi\nprojects based on technology, market, operations, regula-\ntions, management team, and other factors. This can help\nDeFi users make informed decisions about which projects\nto invest in and which to avoid.\n• Automated Trading: AI bots can analyze real-time market\ndata, trends, and opportunities on the DeFi platform to\nautomatically trade digital assets and provide liquidity to\ngenerate maximum profits.\n• Credit Scoring: AI can analyze DeFi users’ transaction\nhistory, loan data, and collateral information to generate\ncredit scores for them. These scores can then be used\nto determine their eligibility for loans and credit limits\nunder the DeFi loan agreement.\n• Personalization: By understanding the user profile, in-\nvestment goals, risk appetite, and portfolio details, AI\ncan provide customized recommendations about interest\nrates and lending options that are best suited for each\nDeFi user.\n• Product Development: Generative AI allows for rapid un-\nderstanding of DeFi users’ needs and issues, developing\nnew products and expanding DeFi’s ecosystem.\n4) Applications for DeFi: In this section, we will show\nhow blockchain and AI technologies can improve the DeFi\necosystem by exploring several applications of DeFi.\n• Agrosurance: Agrosurance aims to revolutionize how\nagricultural insurance and liquidity are managed by de-\nveloping an innovative platform that delivers transparent,\nreliable, and decentralized solutions [173]. This plat-\nform consists of five SCs, each with a unique purpose.\nSpecifically, AgroCoin contract allows the transfer and\nmanagement of AgroCoins between users. AgroSurance-\nLand contract represents and manages land assets by\nminting them into NFTs. StakeManager contract enables\nusers to earn AgroCoins through staking to incentivize\nliquidity and participation within agricultural insurance.\nInsuranceManage uses Chainlink DONs to obtain off-\nchain real-time data to trigger predefined rules to cal-\nculate insurance premiums and verify claim eligibility.\nFundManager contract acts as a repository for managed\nfunds, storing tokens received from the InsuranceManager\nand StakeManager contracts.\n• Prompt DeFi: Prompt DeFi simplifies the interaction\nprocess with DeFi into simple voice commands, thereby\nattracting more users without relevant backgrounds to\nenter the DeFi world [174]. This platform uses ChatGPT\nto execute transactions based on text prompts. In addition,\nthe use of the web3auth library greatly simplifies the\naccount creation process, making new users interacting\nwith Web 3.0 as easy as with Web 2.0. For example,\nPrompt DeFi integrates prominent DeFi platforms, in-\ncluding Uniswap, Lido, and Aave. This allows users\nto easily send and exchange tokens through Uniswap,\ndeposit funds into Lido, and manage loans in Aave.\nFurthermore, the platform utilizes Chainlink Automations\nto incorporate additional portfolio triggers, enhancing the\noverall user experience.\n• RoboFI: RoboFi is a robotic DeFi ecosystem that enables\nrobotic entities to generate and trade Energy Attribute\nCertificates (EACs) via a decentralized infrastructure\npowered by blockchain [175]. In RoboFi, there are two\nrobotic entities that provide commercial services for\nhumans and other robots. One of the robots, called EAC\nprovider, owns a solar power plant that produces green\nelectricity. When 1 MWh of electricity is generated, 1\nEAC NFT is created to confirm the fact and origin of\nthis electricity. The other robot, called EAC consumer,\nis charged from the common power grid of the RoboFi\necosystem. To be sustainable, the EAC consumer needs\nto confirm the origin and track of consumed electricity\nby connecting to the RoboFi NFT EACs trading platform.\nThe EAC consumer can showcase that it has the certifi-\ncate to use the corresponding amount of green energy,\nconfirming the creation of sustainable Value.\n5) Issues: While DeFi can minimize transaction risks by\neliminating third parties and enabling the exchange of financial\nassets on a trustless basis, innovations always come with a new\nset of issues. In particular, DeFi has not been stress tested for\n27\nTABLE VI\nISSUES OF DEFI.\nTypes\nDescription\nTechnical\nScalability\nThe slow-transaction nature of the consensus mechanism limits large-scale adoption.\nOracle\nIt is difficult for off-chain data to be reported securely on-chain.\nOperational security\nA malicious third party could break the SC once they get the key.\nCustodial risk\nThe theft of private keys can be catastrophic for users.\nBias\nData-driven decisions on DeFi protocols may reflect or even amplify biases.\nLimited data\nLimited transaction data makes it difficult to train accurate AI models.\nIntegration\nIntegrating centralized AI models and systems into a decentralized DeFi protocol is difficult.\nOthers\nRegulatory\nFinding the right regulatory balance will be tricky.\nCollateralization\nOver-collateralization will limit DeFi lending business.\nDependencies\nThe openness and composability of DeFi introduce dependencies to the system.\nResponsibility\nDeFi shifts the responsibility from the third party to the user.\nlong-term or widespread use. As shown in Table VI, a number\nof key issues must be addressed in order to offer customers and\ninstitutions a reliable, fault-tolerant ecosystem that can handle\nnew financial applications at scales [167], [176]–[178].\nC. DAOs\n1) What is a DAO? A DAO is an organization that operates\nfully autonomously on a blockchain, conforming to rules\nencoded through SCs and their underlying consensus mecha-\nnisms. It is designed to reduce or bypass the need for cascading\nhuman intervention or centralized coordination [179]. For this\nreason, a DAO is often referred to as a trustless system, which\ndiffers from the traditional model of management by a small\ngroup of people. All the rules are set up in advance in a\nSC and executed by P2P computing nodes. A more detailed\ncomparison between DAOs and traditional organizations is\nshown in Table VII [180]–[182].\n2) Blockchain for DAO: The underlying technology of\nDAO is the blockchain. It relies heavily on SCs, which are\ntransparent, verifiable, autonomous, and publicly auditable.\nThe workflow of DAO is shown in Fig. 22. SCs are used\nto establish the rules of DAO, which are set by a core team of\ncommunity members. Due to the tamper-proof nature of the\nblockchain, once the contract is in effect on the blockchain,\nno one can change the code without a consensus reached\nthrough a vote of the members. The rules and logic in the code\nstrictly limit its functionality [183]–[185]. Financing is usually\nachieved through a token offering, in which case the tokens are\nsold to raise funds and replenish the coffers of DAO. Token\nholders receive voting rights in exchange for their money. The\nvoting rights are usually proportional to their holdings. Once\nfundraising is complete, DAO is ready for deployment. No\nparticular organization has the right to change the code in the\nSC. It is entirely up to the token holders to decide. Based on\nthese features, DAO can provide significant support for many\napplications.\n3) AI for DAO: The combination of DAO and AI can\nbe complementary. AI plays a pivotal role in bringing more\nfunctionality and greater efficiency to DAOs. AI gains the\nresources it lacks; on the other hand, DAO gets critical\nautonomous decision-making capabilities [186]. In the context\nof Web 3.0, AI can enhance DAOs to fit their mission in\nnumerous ways.\n• Autonomous functions: AI can autonomously perform\ncertain automated tasks, such as computation and data\nanalysis, based on constraints, goals, and rules defined\nby a DAO.\nTABLE VII\nDIFFERENCES BETWEEN DAOS AND TRADITIONAL ORGANIZATIONS.\nAttributes\nDAOs\nTraditional organizations\nTrust\nBlockchain\nExperience\nGovernance\nCommunity\nMain stakeholders\nStructure\nDemocratic\nHierarchical\nTransparency\nComplete\nRestricted\nPattern\nCollaboration\nCompetition\nService\nFully automated\nCentralized automation\nAccess\nOpen\nClosed\nAffiliation\nMultiple\nOne\nCost\nLow\nHigh\n28\nDevelopers\nSmart\ncontract\nBlockchain\nEthereum Virtual Machine\n(Ethereum, Solana, etc.)\nVoting\nGovernance\nmechanism\ntokens\nTest &\nDeployment\nCommunity\nSmart contract\ncreation\nFunding for\ngovernance\nApplications\nBusiness\nservices\nFig. 22. DAO workflow.\n• Enhanced control: AI integrated into a DAO has no\ncentralized control by the nature of DAOs. Its knowledge\nand capabilities will be designed to serve the overall goals\nand tasks of a DAO in a transparent and decentralized\nmanner, thus enhancing decentralized control.\n• Facilitate collaboration: AI integrated into DAOs can\nhelp facilitate collaboration among different stakeholders\nby providing shared information, coordination tools, and\nalignment metrics.\n• SCs: Generative AI can aid in the rapid development of\nSCs by precisely coding the goals and rules of the DAO\nso that the SC enforces these terms in a fair manner.\n• Monitoring: AI can help continuously monitor key met-\nrics, risks, and processes within a DAO, providing com-\nprehensive reporting for greater transparency and ac-\ncountability.\n4) Applications for DAO: In this section, we will show the\npromise of DAO powered by blockchain and AI technologies\nin decentralized governance through specific applications.\n• OmniGovern DAO: OmniGovern is a decentralized gov-\nernance system deployed on a layer 2 blockchain, de-\nsigned to simplify on-chain governance [187]. To enable\nseamless governance across blockchains, Layerzero acts\nas an interoperable middleware that connects multiple\nblockchains with Omnichain Fungible Token, facilitating\ngas-less transactions through a relay mechanism. World-\ncoin’s authentication mechanism is used to eliminate po-\ntential bot activity to ensure the integrity and authenticity\nof votes and proposals. OmniGovern implements robust\naccount abstraction on the Base Gorelli chain to simplify\nthe complexity of user interaction with the platform by\nmasking complex blockchain details. Additionally, Cova-\nlent’s integration ensures transparency of voting results,\nproposal history, and token analysis, promoting trust and\naccountability.\n• Rooster DAO: Rooster DAO is an investment fund man-\naged in the form of DAO, focusing solely on investments\nin the Dotsama ecosystem [188]. To incentivize active\nparticipation, every member of Rooster Dao owns an\nevolving NFT that represents their level of engagement\nin investment proposals and voting. As members actively\ncontribute, the rooster image gains color and levels up.\nMoreover, when a member proposes a highly profitable\ninvestment, all members collectively transfer a portion\nof the profits to the proposer. Specifically, there are\ntwo types of SCs. The NFT management contract is\nresponsible for creating collections owned by the contract\nitself, minting and transferring NFTs, validating owner-\nship, and adding resources to or removing resources from\nNFTs. The governance contract interacts with the NFT\nmanagement contract to track proposals, authorizations,\nand votes.\n• DAOasis: DAOasis provides a social networking platform\nfacilitating the creation and management of multisigniture\nauthorities [189]. This empowers users to execute trans-\nactions to manage their digital assets, handle customized\ntransactions, and perform secure cross-chain interoper-\nability. Specifically, Polybase is a decentralized database\nthat provides a secure and decentralized method for data\ninteraction. The Gnosis Safe wallet offers users the ability\nto create accounts and safes. The Safe is a multi-signature\nwallet that requires a minimum number of signatures to\nperform a transaction, ensuring maximum security for\nall involved parties. Connext facilitates seamless interac-\ntions across multiple blockchains by enabling cross-chain\ntransactions and fund transfers.\n5) Issues: Although DAOs are still in the early stages of\ndevelopment, it has attracted widespread attention. However,\nimproperly building or maintaining a DAO can have serious\nconsequences. Since a DAO directly controls assets, vulnera-\nbilities always can cause catastrophic damage. In addition, due\nto their infrastructure, DAOs suffer from many of the same\nlimitations and security issues as the blockchains on which\nthey operate. Beyond that, some of the major limitations, as\nwell as issues, are listed in Table VIII [190]–[193].\nVII. CHALLENGES AND FUTURE RESEARCH DIRECTIONS\nAdvanced technologies, represented by blockchain, AI, and\nedge computing are driving the rapid development of the Web\n3.0 ecosystem, which is expected to revolutionize the way\npeople interact with the Web. However, the fast iteration of\nthese technologies also presents many challenges and limi-\ntations to Web 3.0. The miscreants are well aware of this\nand try to exploit this iterative gap for their own nefarious\npurposes. As a result, some major challenges and open issues\nneed to be addressed urgently. In the following, we will discuss\nsome of the major issues that Web 3.0 is facing [194]–[197].\nAdditionally, we also discuss the potential research directions\nfor building future Web 3.0 ecosystem.\nA. Key challenge and research direction of Web 3.0 in the\ncontext of blockchain\n1) Key challenge: Scalability has proven to be a major\nobstacle to the rapid development of the Web 3.0 ecosystem.\nScalability refers to the ability of a blockchain network to\ndevelop and adapt to growing demands as more users are\nadded to the network without compromising its security or\neffectiveness. As a typical problem of the blockchain trilemma,\nthere is no general solution as of today. As the underlying\n29\nTABLE VIII\nISSUES OF DAOS.\nTypes\nDescription\nTechnical\nSecurity\nThe code is extremely difficult to fix, thus leaving a vulnerability.\nSpeed\nEvery user is given an opportunity to vote, which requires a longer voting period.\nEngagement\nAbandoning participation in governance will lead to a re-centralization of power.\nPseudonym\nPseudonyms may hinder efforts to combat financial crime.\nUnfairness\nAutonomous attributes may be undermined by a few users who have a larger voice.\nConsistency\nData bias makes it challenging to fully align AI’s mission with DAO’s goals.\nAutonomy\nThe integration of AI into DAOs brings some centralization of control and power.\nTransparency\nThe lack of interpretability of AI can pose a challenge to DAO’s decision-making process.\nOthers\nRegulatory\nThe legal status is typically ambiguous and may change depending on the jurisdiction.\nInefficiency\nIt is easy for a DAO to spend much more time discussing than implementing.\nSocial\nInactive or non-voting shareholders can cause disruptions in an organization’s operations.\nEducation\nIt is difficult for people with different backgrounds to develop strategies together.\necology of Web 3.0, the blockchain platform often needs\nto make a trade-off between scalability, decentralization, and\nsecurity in different scenarios. For example, Blockchain 3.0\nchooses to sacrifice security for high throughput and fast\ntransactions. This results in lower fault tolerance than those in\nblockchain 1.0 and blockchain 2.0. This could make Web 3.0\nsolutions based on such blockchain platforms more vulnerable\nto attacks. Meanwhile, digital wallets, existing as Web 3.0\nportals, typically as browser extensions, pose security issues\nsince digital wallets are connected to the blockchain through\na centralized platform at this stage. Once the centralized plat-\nform is compromised, users will suffer huge financial losses.\nFor example, according to the Twitter account, Solana Status,\nan unidentified hacker has stolen approximately $8 million\nfrom approximately 8,000 wallets on the Solana network\n[198]. Therefore, the resolution of the trilemma, or how to\nmake effective trade-offs, will greatly affect the development\nand deployment of Web 3.0.\n2) Future direction: To effectively solve the scalability\nchallenges faced by decentralized technologies required by\nWeb 3.0, sharding is a promising solution. Although the\nconcept of sharding has been proposed for years as a solu-\ntion to scalability challenges, mainstream Web 3.0 platforms\nhave yet to fully integrate sharding technology. The devel-\nopment and implementation of practical sharding techniques\nfor Web 3.0 applications remain an ongoing area of research.\nSpecifically, cross-shard communication is an urgent problem\nthat needs to be solved as it requires additional protocols\nand mechanisms to ensure the consistency and validity of\ndata and transactions across shards. Sharding security is also\nimportant for the Web 3.0 ecosystem. It refers to the risk\nof malicious nodes taking over a shard and manipulating its\noperations. One attractive solution to strengthen shard security\nis by using randomization and incentives to assign nodes to\nshards while applying cryptographic proofs (e.g., ZK proofs)\nto detect malicious behavior. Additionally, layer 2 scaling\nsolutions are another important research direction that could\ncomplement sharding. By combining sharding with layer 2\nsolutions, blockchain networks can dramatically increase their\nthroughput, thus realizing the Web 3.0 decentralized vision.\nFor example, state channels allow high-frequency transactions\nto be processed off-chain within individual shards, while only\nsettlement states are periodically committed on-chain. Cross-\nshard state channels are used to maintain interconnectivity. In\nthis way, the scaling issue will be effectively mitigated by\ncombining layer 1 sharding with a layer 2 solution, which\nallows blockchain-powered Web 3.0 to support massive data\nconcurrency.\nB. Key challenge and research direction of Web 3.0 in the\ncontext of AI\n1) Key challenge: Unconscious bias refers to implicit at-\ntitudes and stereotypes that influence people’s understanding,\nactions, and decisions in an unconscious manner. Although\nWeb 3.0 is still in its early stages, unconscious bias seems\nto be creeping in. According to a Bloomberg report, in\nDecember 2021, digital avatars of popular CryptoPunks NFTs\nfluctuated in price based on race, gender, and skin color, with\nmedium and dark-skinned avatars averaging less than light-\nskinned NFTs [199]. The researchers at People of Crypto\nLab, an organization aiming to promote diversity, equity, and\ninclusion in the Web 3.0 ecosystem, examined the current\nstate of gender diversity among Web 3.0 startup founders\nand investors. They used Crunchbase’s extensive database of\n30\nnearly 2,800 participants worldwide to classify and analyze\nparticipants based on gender. Only 13% of Web 3.0 startups\ninclude females. Additionally, only 7% of the founders of Web\n3.0 startups are female. Both numbers are worse than average\nfor startups overall [200]. The lack of gender balance in the\nWeb 3.0 ecosystem has significant implications for how people\nself-present, conduct business, and interact with each other\nonline. As a result, the impacts of current underrepresenta-\ntion maybe greater than in previous generations of the Web.\nAdditionally, AI algorithms also display unconscious bias due\nto the unbalanced datasets they are trained with. For instance,\nAmazon had to stop using an AI recruiting tool that was biased\nagainst women in 2018. The tool was trained on a dataset\ncontaining resumes of applicants dating back 10 years. This\ndataset consisted mostly of male candidates, causing the AI\nalgorithm to degrade resumes containing keywords such as\n“woman” and “female” [201]. In 2019, researchers discovered\nbias against black patients in a commercially accessible AI\nsystem designed to predict patient outcomes. The algorithm\nhad primarily been trained on data from white patients, re-\nsulting in higher misdiagnosis rates for black patients [202].\nUtilizing the biased dataset can harm the Web 3.0 ecosystem.\nGiven the signs of these impending problems, unconscious\nbias will be one of the major challenges for the Web 3.0\necosystem.\n2) Future direction: The main reason for introducing unin-\ntentional bias is usually that the training data is unbalanced or\nunrepresentative. However, data diversity is not always fully\nachieved in the real world due to factors such as structural in-\nequalities and historical patterns. When AI systems developed\nbased on such data become widely used, unconscious bias\ncan create a vicious cycle. This is particularly concerning as\ngenerative AI plays an increasingly important role in creating\nvast amounts of new digital content in the decentralized Web\n3.0 ecosystem. It is crucial to ensure that such content is not\nbiased. Given the prevalence of generative AI, a promising\nresearch direction is to build an AIGC-driven bias-free Web\n3.0 ecosystem. Specifically, unconscious bias in Web 3.0 can\nbe effectively reduced by leveraging AIGC to generate training\ndata that scales diversity and inclusion. Furthermore, to build\na more inclusive and secure Web 3.0, it is necessary to rethink\nfairness as well as privacy and security in AIGC-driven Web\n3.0. An unfair AIGC model may further exacerbate inequalities\nin the Web 3.0 ecosystem. It is critical to ensure that AIGC\nalgorithms are designed to promote inclusivity and avoid\nreinforcing bias. With the rise of AIGC, the digital economy\ndriven by Web 3.0 has been greatly enriched. The classic\nissues of privacy and security will also be an important area\nof research.\nC. Key challenge and research direction of Web 3.0 in the\ncontext of edge computing\n1) Key challenge: Managing a large number of intercon-\nnected and heterogeneous devices poses significant challenges\nto the Web 3.0 ecosystem. As devices become more connected\nthrough edge computing architecture, threats can now spread\nmore easily between devices. A vulnerability in one device\nmay affect many other devices or even paralyze the entire sys-\ntem [203]. The devices themselves also come in many different\nforms, with different hardware, software, operating systems,\nand use cases. For example, smartphones and IoT sensor\nnodes will have very different technical specifications and\ndeployment environments. This high degree of heterogeneity\nmeans that universal security solutions must account for a large\nnumber of potential configurations and usage patterns. As the\nnumber of connected devices continues to grow exponentially,\nthe ways in which these different devices interact with each\nother also grow dramatically. It becomes incredibly difficult\nto develop a security approach that perfectly addresses each\nunique scenario. Solutions designed for maximum generality\nmay lack accuracy for certain device types or environments.\nHowever, an approach that is too specific will not be able to\nscale and cover the entire content of the device ecosystem.\nHow to achieve the right trade-off between generality and\naccuracy is the key to solving the problem [204]. Furthermore,\ncoordinating edge computing resources in a decentralized\nmanner is a challenging task. Traditional centralized man-\nagement approaches rely on a central authority or control\npoint and may not scale well in a decentralized network\nenvironment. Decentralized coordination of edge computing\nresources involves distributing decision-making and control\nmechanisms among multiple nodes or entities within the\nnetwork. This approach aligns with Web 3.0 principles, which\naim to distribute power and control among network partic-\nipants. This requires further exploration of edge computing\nand blockchain technologies (e.g., consensus protocols, SCs,\netc.).\n2) Future direction: Solving device management and re-\nsource allocation issues in the Web 3.0 ecosystem requires\nthe development of adaptive and scalable approaches. One\npotential research direction is the modular architecture and\nprotocol design of edge computing-enabled Web 3.0 to adapt\nto different device types, configurations, and use cases. These\nframeworks should enable seamless integration and interop-\nerability between heterogeneous devices to facilitate commu-\nnication and collaboration across the Web 3.0 ecosystem. In\naddition, since edge devices may dynamically join or leave\nthe network, the allocation of resources and tasks becomes\nmore challenging. Therefore, developing decentralized algo-\nrithms and mechanisms for resource allocation, load balancing,\nand task offloading helps optimize resource utilization and\nensure efficient coordination among edge devices. Specifically,\nconsidering the functionality and availability of edge devices\nis crucial for the design of intelligent resource allocation\nalgorithms. These algorithms should efficiently distribute tasks\namong edge devices to maximize resource utilization while\nminimizing latency and energy consumption. Second, design-\ning a load balancing mechanism is key to achieving even\nworkload distribution across edge devices. Load balancing\nalgorithms should consider factors such as device capacity,\nnetwork congestion, and task demands to ensure optimal re-\nsource utilization and prevent overloading of specific devices.\nThird, effective task offloading strategies need to be developed\nto determine when and which tasks should be offloaded\nfrom edge devices to other edge devices or edge computing\n31\nclusters for acceleration, load balancing, etc. These policies\nshould consider aspects such as task characteristics, network\nconditions, and device capabilities to minimize latency and\nimprove overall system performance, thereby facilitating the\nscheduling of task processing in a system-wide view.\nVIII. CONCLUSION\nThis paper conducted a thorough investigation of the impact\nof blockchain, AI, and edge computing on Web 3.0, the most\npromising technologies driving the next generation of the\nWeb. By exploring the development of the Web at different\nstages, the necessity and timeliness of web evolution are\nclarified. Technically, Web 3.0 is a back-end evolution based\non blockchain technology that allows for the distribution of\npower and trust, enabling users to have more control over\ntheir personal data and digital assets. AI can empower Web\n3.0 with key features, such as intelligent automation, enhanced\nsecurity, and improved governance. Conversely, Web 3.0 can\nprovide AI with the two most important elements: data and\ncomputing power. Edge computing brings practical benefits\nsuch as low latency and cost-effective performance to the\nWeb 3.0 ecosystem. Then, this article conducted an extensive\nliterature review and discussed the practical applications of\neach technology in Web 3.0. We also proposed decentralized\nstorage and computing solutions by exploring the integration\nof technologies. Furthermore, we had an in-depth discussion\non the mainstream use cases (i.e., NFTs, DeFi, and DAO)\nfrom the aspects of definition, key attributes, related appli-\ncations, and potential issues. Finally, the key challenges and\npotential research directions were raised to provide guidance\nfor research in related fields. Overall, Web 3.0 is envisioned as\nan ecosystem, built on top of blockchain, powered by AI, and\noptimized via edge computing, with the potential to change\nthe way people interact with information fundamentally. We\nexpect that this survey can facilitate a clearer understanding\nof Web 3.0 and inspire further innovative research within this\nemerging field.\nREFERENCES\n[1] Statista, “Worldwide digital population July 2022,” https://www.statis\nta.com/statistics/617136/digital-population-worldwide/#statisticConta\niner, Sep. 2022.\n[2] G. Korpal and D. Scott, “Decentralization and Web3 technologies,”\n2022, techRxiv preprint.\n[3] Web3Foundation, “Web 3.0 technology stack,” https://web3.foundatio\nn/about/, 2022.\n[4] S. Voj´ıˇr and J. Kuˇcera, “Towards re-decentralized future of the web:\nPrivacy, security and technology development,” Acta Informatica Pra-\ngensia, vol. 2021, no. 3, pp. 349–369, 2021.\n[5] J. Zarrin et al., “Blockchain for decentralization of Internet: prospects,\ntrends, and challenges,” Cluster Computing, vol. 24, no. 4, pp. 2841–\n2866, May 2021.\n[6] Q. Wang et al., “Exploring Web3 from the view of blockchain,” 2022,\narXiv preprint arXiv:2206.08821.\n[7] P. Ray, “Web3: A comprehensive review on background, technologies,\napplications, zero-trust architectures, challenges and future directions,”\nInternet of Things and Cyber-Physical Systems, 2023.\n[8] W. Gan et al., “Web 3.0: The future of Internet,” 2023, arXiv preprint\narXiv:2304.06032.\n[9] X. Ren et al., “Building resilient Web 3.0 with quantum informa-\ntion technologies and blockchain: An ambilateral view,” 2023, arXiv\npreprint arXiv:2303.13050.\n[10] R. Huang et al., “An overview of Web3. 0 technology: Infrastructure,\napplications, and popularity,” 2023, arXiv preprint arXiv:2305.00427.\n[11] M. Shen et al., “Artificial intelligence for Web 3.0: A comprehensive\nsurvey,” 2023, arXiv preprint arXiv:2309.09972.\n[12] A. Beniiche et al., “Society 5.0: Internet as if people mattered,” IEEE\nWireless Communications, vol. 29, no. 6, pp. 160–168, 2022.\n[13] A. Park et al., “Interoperability: Our exciting and terrifying Web3\nfuture,” Business Horizons, vol. 66, no. 4, pp. 529–541, 2023.\n[14] T. O’Reilly, “What is Web 2.0? design patterns and business models\nfor the next generation of software,” https://www.oreilly.com/pub/a/we\nb2/archive/what-is-web-20.html, Sep. 2005.\n[15] Ethereum, “Introduction to Web3,” https://ethereum.org/en/web3/,\nMay. 2022.\n[16] T. Berners-Lee et al., “Solid protocol,” https://solidproject.org/TR/prot\nocol#terminology, Dec. 2020.\n[17] World-Wide-Web-Foundation, “Three challenges for the web, accord-\ning to its inventor,” https://webfoundation.org/2017/03/web-turns-28-l\netter/, Mar. 2017.\n[18] PewResearchCenter, “Americans and privacy: Concerned, confused and\nfeeling lack of control over their personal information,” https://www.\npewresearch.org/internet/2019/11/15/americans-and-privacy-concern\ned-confused-and-feeling-lack-of-control-over-their-personal-informa\ntion/pi 2019-11-14 privacy 0-01/, Nov. 2019.\n[19] Statista, “Number of data records exposed worldwide from 1st quarter\n2020 to 1st quarter 2023,” https://www.statista.com/statistics/1307426/\nnumber-of-data-breaches-worldwide/, Jun. 2023.\n[20] S. Duan, M. Reiter, and H. Zhang, “BEAT: Asynchronous BFT made\npractical,” in Proceedings of ACM SIGSAC Conference on Computer\nand Communications Security, Jan. 2018, pp. 2028–2041.\n[21] M. Yin, D. Malkhi, M. Reiter, G. Gueta, and I. Abraham, “Hotstuff:\nBFT consensus with linearity and responsiveness,” in Proceedings of\nthe ACM Symposium on Principles of Distributed Computing (PODC),\nJul. 2019, pp. 347–356.\n[22] A. Miller, Y. Xia, K. Croman, E. Shi, and D. Song, “The Honey Badger\nof BFT protocols,” in ACM SIGSAC Conference on Computer and\nCommunications Security, Oct. 2016.\n[23] M. Jalalzai, C. Busch, and G. Richard, “Proteus: A scalable BFT\nconsensus protocol for blockchains,” in IEEE International Conference\non Blockchain (Blockchain), Jul. 2019.\n[24] G. Gueta, I. Abraham, S. Grossman, D. Malkhi, B. Pinkas, M. Reiter,\nD. Seredinschi, O. Tamir, and A. Tomescu, “SBFT: A scalable and\ndecentralized trust infrastructure,” in Annual IEEE/IFIP International\nConference on Dependable Systems and Networks (DSN), Jun. 2019.\n[25] P. Li, G. Wang, X. Chen, F. Long, and W. Xu, “Gosig: a scalable and\nhigh-performance Byzantine consensus for consortium blockchains,” in\nProceedings of the 11th ACM Symposium on Cloud Computing, 2020,\npp. 223–237.\n[26] S. Nakamoto, “Bitcoin: A peer-to-peer electronic cash system,” 2008.\n[27] G. Wood, “Polkadot: Vision for a heterogeneous multi-chain frame-\nwork,” White Paper, vol. 21, pp. 2327–4662, 2016.\n[28] A. Kiayias, A. Russell, B. David, and R. Oliynykov, “Ouroboros: A\nprovably secure Proof-of-Stake blockchain protocol,” in Advances in\nCryptology – CRYPTO. Lecture Notes in Computer Science, vol. 10401,\n2017.\n[29] Y. Gilad, R. Hemo, S. Micali, G. Vlachos, and N. Zeldovich, “Algo-\nrand: Scaling Byzantine agreements for cryptocurrencies,” in Proceed-\nings of Symposium on Operating Systems Principles, Oct. 2017, pp.\n51–68.\n[30] I. Bentov, C. Lee, A. Mizrahi, and M. Rosenfeld, “Proof of Activity:\nExtending Bitcoin’s Proof of Work via Proof of Stake,” ACM SIG-\nMETRICS Performance Evaluation Review, vol. 42, no. 3, pp. 34–37,\n2014.\n[31] A. Yakovenko, “Solana: A new architecture for a high performance\nblockchain v0. 8.13,” Whitepaper, 2018.\n[32] K. Karantias, A. Kiayias, and D. Zindros, “Proof-of-Burn,” in In-\nternational conference on financial cryptography and data security.\nSpringer, 2020, pp. 523–540.\n[33] NEM, “Nem whitepaper,” https://whitepaper.io/document/583/nem-w\nhitepaper, 2018.\n[34] B. Fisch, “Poreps: Proofs of Space on useful data,” Cryptology ePrint\nArchive, 2018.\n[35] S. Dziembowski, S. Faust, V. Kolmogorov, and K. Pietrzak, “Proofs of\nSpace,” in Annual Cryptology Conference.\nSpringer, Nov. 2015, pp.\n585–605.\n[36] E. Agbozo et al., “Applying multi-criteria decision making to priori-\ntization of Web 3.0 development factors,” in E-business technologies\nconference proceedings, vol. 3, no. 1, 2023, pp. 229–232.\n32\n[37] N. Chaudhry and M. Yousaf, “Consensus algorithms in blockchain:\ncomparative analysis, challenges and opportunities,” in International\nConference on Open Source Systems and Technologies (ICOSST).\nIEEE, 2018, pp. 54–63.\n[38] M.\nFerdous,\nM.\nChowdhury,\nM.\nHoque,\nand\nA.\nColman,\n“Blockchain consensus algorithms: A survey,” 2020, arXiv preprint\narXiv:2001.07091.\n[39] S. Bamakan, A. Motavali, and A. Bondarti, “A survey of blockchain\nconsensus algorithms performance evaluation criteria,” Expert Systems\nwith Applications, vol. 154, p. 113385, 2020.\n[40] I. C. Education, “Artificial intelligence (AI),” https://www.ibm.com/cl\noud/learn/what-is-artificial-intelligence, Jun. 2020.\n[41] H. Hua et al., “Edge computing with artificial intelligence: A machine\nlearning perspective,” ACM Computing Surveys, vol. 55, no. 9, pp. 1–\n35, Apr. 2023.\n[42] J. Bambacht and J. Pouwelse, “Web3: A decentralized societal in-\nfrastructure for identity, trust, money, and data,” 2022, arXiv preprint\narXiv:2203.00398.\n[43] G. Huang et al., “Efficient and low overhead website fingerprinting\nattacks and defenses based on TCP/IP traffic,” in Proceedings of the\nACM Web Conference 2023, Apr. 2023, pp. 1991–1999.\n[44] W. D. la Cadena et al., “Trafficsliver: Fighting website fingerprinting\nattacks with traffic splitting,” in Proceedings of the 2020 ACM SIGSAC\nConference on Computer and Communications Security, Oct. 2020, pp.\n1971–1985.\n[45] S. Voshmgir, Token Economy: How the Web3 reinvents the Internet.\nToken Kitchen, 2020, vol. 2.\n[46] P. Kasireddy, “The architecture of a Web 3.0 application,” https://www.\npreethikasireddy.com/post/the-architecture-of-a-web-3-0-application,\nSep. 2021.\n[47] H. Xu et al., “deController: a Web3 native cyberspace infrastructure\nperspective,” IEEE Communications Magazine, 2023.\n[48] C. Bassi, “Sustainable blockchain: Estimating the carbon footprint of\nalgorand’s pure Proof-of-Stake,” https://algorand.com/resources/blog/\nsustainable-blockchain-calculating-the-carbon-footprint, Apr. 2021.\n[49] V. Kohli et al., “An analysis of energy consumption and carbon\nfootprints of cryptocurrencies and possible solutions,” Digital Com-\nmunications and Networks, vol. 9, no. 1, pp. 79–89, Jun 2022.\n[50] Digiconomist, “Bitcoin energy consumption index,” https://digiconomi\nst.net/bitcoin-energy-consumption, Nov. 2023.\n[51] ——, “Ethereum energy consumption index,” https://digiconomist.net\n/ethereum-energy-consumption, Nov. 2023.\n[52] L. Breidenbach et al., “Chainlink 2.0: Next steps in the evolution\nof decentralized oracle networks,” Chainlink Labs, vol. 1, pp. 1–136,\n2021.\n[53] V. Buterin, “Chain interoperability,” R3 Research Paper, vol. 9, 2016.\n[54] R. Belchior, A. Vasconcelos, S. Guerreiro, and M. Correia, “A survey\non blockchain interoperability: Past, present, and future trends,” ACM\nComputing Surveys, vol. 54, no. 8, pp. 1–41, 2021.\n[55] G. Wang, Q. Wang, and S. Chen, “Exploring blockchains interoper-\nability: A systematic survey,” ACM Computing Surveys, 2023.\n[56] M. Borkowski, D. McDonald, C. Ritzer, and S. Schulte, “Towards\natomic cross-chain token transfers: State of the art and open questions\nwithin tast,” Distributed Systems Group TU Wien (Technische Universit\nat Wien), Report, vol. 8, 2018.\n[57] Multichain, “Multichain bridge,” https://docs.multichain.org/getting-s\ntarted/introduction.\n[58] Threshold, “tBTC bridge,” https://threshold.network/earn/btc/.\n[59] Parity, “Bridging the dapp-scaling now with parity bridge,” https://ww\nw.parity.io/blog/tag/parity-bridge, Mar. 2018.\n[60] Solana, “Wormhole,” https://solana.com/ecosystem/wormhole, Apr.\n2020.\n[61] C. Smith et al., “Scaling,” https://ethereum.org/en/developers/docs/sc\naling/, Apr. 2023.\n[62] Ethereum, “Danksharding,” https://ethereum.org/en/roadmap/dankshar\nding/, Nov. 2023.\n[63] P. Joseph and D. Thaddeus, “The bitcoin lightning network: Scalable\noff-chain instant payments,” 2016.\n[64] Raiden-Network, “What is the raiden network?” https://raiden.netwo\nrk/101.html.\n[65] A. Cahill and S. Deshpande, “Layer-2 scaling solutions: A framework\nfor comparison,” https://www.tbstat.com/wp/uploads/2022/05/202205\n05 Layer2ScalingSolutions TheBlockResearch.pdf, May 2022.\n[66] Liquid-Network, “The liquid network,” https://liquid.net/.\n[67] A. Tripathi, “Introduction to Polygon PoS,” https://wiki.polygon.techn\nology/docs/pos/polygon-architecture/, Jun 2023.\n[68] J. Benet, “IPFS - content addressed, versioned, P2P file system,” 2014,\narXiv preprint arXiv:1407.3561.\n[69] P. Drakatos et al., “Triastore: A Web 3.0 blockchain datastore for\nmassive IoT workloads,” in 2021 22nd IEEE International Conference\non Mobile Data Management (MDM), 2021, pp. 187–192.\n[70] Z. Liu et al., “Make Web 3.0 connected,” IEEE Transactions on\nDependable and Secure Computing, vol. 19, pp. 2965–2981, 2022.\n[71] A. Chopra et al., “Va3: A Web 3.0 based I2I power transaction\nplatform,” in 2022 7th IEEE Workshop on the Electronic Grid (eGRID),\n2022, pp. 1–5.\n[72] Y. Lin et al., “A unified blockchain-semantic framework for wireless\nedge intelligence enabled Web 3.0,” IEEE Wireless Communications,\n2023.\n[73] D. Palanikkumar et al., “An enhanced decentralized social network\nbased on Web3 and IPFS using blockchain,” in 2023 7th International\nConference on Trends in Electronics and Informatics (ICOEI), 2023,\npp. 616–623.\n[74] A. Petcu et al., “A secure and decentralized authentication mechanism\nbased on Web 3.0 and Ethereum blockchain technology,” Applied\nSciences, vol. 13, no. 4, 2023.\n[75] A. Razzaq et al., “IoT data sharing platform in Web 3.0 using\nblockchain technology,” Electronics, vol. 12, no. 5, 2023.\n[76] Y. Lin et al., “A blockchain-based semantic exchange framework\nfor Web 3.0 toward participatory economy,” IEEE Communications\nMagazine, Aug. 2023.\n[77] S. Guo et al., “Blockchain-assisted privacy-preserving data computing\narchitecture for Web3,” IEEE Communications Magazine, vol. 61,\nno. 8, pp. 28–34, Aug. 2023.\n[78] Y. Qiu et al., “Fog-assisted blockchain radio access network for Web3,”\nIEEE Communications Magazine, Aug. 2023.\n[79] G. Yu et al., “Towards Web3 applications: Easing the access and\ntransition,” 2022, arXiv preprint arXiv:2210.05903.\n[80] Y. Lin et al., “Blockchain-aided secure semantic communication for AI-\ngenerated content in Metaverse,” IEEE Open Journal of the Computer\nSociety, vol. 4, pp. 72–83, 2023.\n[81] ——, “A unified framework for integrating semantic communica-\ntion and AI-generated content in Metaverse,” 2023, arXiv preprint\narXiv:2305.11911.\n[82] G. Liu et al., “Semantic communications for artificial intelligence\ngenerated content (AIGC) toward effective content creation,” 2023,\narXiv preprint arXiv:2308.04942.\n[83] L. Xia et al., “Generative AI for semantic communication: Architecture,\nchallenges, and outlook,” 2023, arXiv preprint arXiv:2308.15483.\n[84] R. Cheng et al., “A wireless AI-generated content (AIGC) provisioning\nframework empowered by semantic communication,” 2023, arXiv\npreprint arXiv:2310.17705.\n[85] H. Du et al., “Enabling AI-generated content (AIGC) services in\nwireless edge networks,” 2023, arXiv preprint arXiv:2301.03220.\n[86] Y. Liu et al., “Blockchain-empowered lifecycle management for AI-\ngenerated content (AIGC) products in edge networks,” 2023, arXiv\npreprint arXiv:2303.02836.\n[87] M. Xu et al., “Joint foundation model caching and inference of\ngenerative AI services for edge intelligence,” 2023, arXiv preprint\narXiv:2305.12130.\n[88] H. Du et al., “Generative AI-aided optimization for AI-generated\ncontent (AIGC) services in edge networks,” 2023, arXiv preprint\narXiv:2303.13052.\n[89] J. Wang et al., “A unified framework for guiding generative AI with\nwireless perception in resource constrained mobile edge networks,”\n2023, arXiv preprint arXiv:2309.01426.\n[90] Y. Cao et al., “A comprehensive survey of AI-generated content\n(AIGC): A history of generative AI from GAN to ChatGPT,” 2023,\narXiv preprint arXiv:2303.04226.\n[91] C. Zhang et al., “A complete survey on generative AI (AIGC): Is\nChatGPT from GPT-4 to GPT-5 all you need?” 2023, arXiv preprint\narXiv:2303.11717.\n[92] I. C. Education, “Natural language processing (NLP),” https://www.ib\nm.com/cloud/learn/natural-language-processing, Jul. 2020.\n[93] M. Treviso et al., “Efficient methods for natural language processing: A\nsurvey,” Transactions of the Association for Computational Linguistics,\nvol. 11, pp. 826–860, 2023.\n[94] C. Qin et al., “Is ChatGPT a general-purpose natural language pro-\ncessing task solver?” 2023, arXiv preprint arXiv:2302.06476.\n[95] D. Khurana, A. Koli, K. Khatter, and S. Singh, “Natural language\nprocessing: State of the art, current trends and challenges,” Multimedia\ntools and applications, vol. 82, no. 3, pp. 3713–3744, 2023.\n33\n[96] N. Le et al., “Deep reinforcement learning in computer vision: A\ncomprehensive survey,” Artificial Intelligence Review, pp. 1–87, 2022.\n[97] Y. Bi et al., “A survey on evolutionary computation for computer\nvision and image analysis: Past, present, and future trends,” IEEE\nTransactions on Evolutionary Computation, 2022.\n[98] A. Vaswani et al., “Attention is all you need,” Advances in neural\ninformation processing systems, vol. 30, 2017.\n[99] I. Goodfellow et al., “Generative adversarial nets,” in Advances in\nneural information processing systems, 2014, pp. 2672–2680.\n[100] D. Kingma et al., “Auto-encoding variational bayes,” 2013, arXiv\npreprint arXiv:1312.6114.\n[101] K. Gregor et al., “Deep autoregressive networks,” in International\nConference on Machine Learning, 2014, pp. 1242–1250.\n[102] AletheaAI, “Robert Alice,” https://www.sothebys.com/en/buy/auction/\n2021/natively-digital-a-curated-nft-sale-2/to-the-young-artists-of-cyb\nerspace, Jun. 2021.\n[103] J. Pregelj, “Web3 plugin for ChatGPT,” https://github.com/jernejprege\nlj/web3-chatgpt-plugin, May 2023.\n[104] D. Sathavara et al., “SuperCool-AI,” https://supercool.vercel.app/, Jun\n2023.\n[105] M. Sokoli et al., “Web3GPT,” https://w3gpt.ai/, May 2023.\n[106] J. Savage, “ETHGPT,” https://github.com/Jsavage1325/ETHGPT, May\n2023.\n[107] C. Yang et al., “FlashGPT,” https://github.com/alt-research/flashGPT,\nMar. 2023.\n[108] TokenGPT, “Tokengpt,” https://ethglobal.com/showcase/tokengpt-ko8\nx6, May 2023.\n[109] M. Zhang, “CoinGPT,” https://github.com/mccowanzhang/coingpt,\nJun. 2023.\n[110] Memosys and Greg, “Defi-companion-covalent,” https://github.com/g\nregfromstl/defi-companion, Aug. 2023.\n[111] Quantstamp, “Quantstamp,” https://quantstamp.com/, 2017.\n[112] ChainSecurity, “Chainsecurity,” https://chainsecurity.com/, 2017.\n[113] K. Gupta et al., “Secure Semantic Snap,” https://nozk.kanavgupta.xyz/,\nDec 2022.\n[114] A. Alam et al., “MedDAO,” https://github.com/Arsalaan-Alam/hackfs,\nJun. 2023.\n[115] A. Shamir, “How to share a secret,” Communications of the ACM,\nvol. 22, no. 11, pp. 612–613, 1979.\n[116] S. Das et al., “Practical asynchronous high-threshold distributed key\ngeneration and distributed polynomial sampling,” in 32nd USENIX\nSecurity Symposium (USENIX Security 23), Aug. 2023, pp. 5359–5376.\n[117] ——, “A new paradigm for verifiable secret sharing,” 2023, cryptology\nePrint Archive.\n[118] C. Ge et al., “Revocable identity-based broadcast proxy re-encryption\nfor data sharing in clouds,” IEEE Transactions on Dependable and\nSecure Computing, vol. 18, no. 3, pp. 1214–1226, 2019.\n[119] W. Zhang et al., “A secure revocable fine-grained access control and\ndata sharing scheme for SCADA in IIoT systems,” IEEE Internet of\nThings Journal, vol. 9, no. 3, pp. 1976–1984, 2021.\n[120] J. Zhang et al., “Revocable and privacy-preserving decentralized data\nsharing framework for fog-assisted Internet of Things,” IEEE Internet\nof Things Journal, vol. 9, no. 13, pp. 10 446–10 463, 2021.\n[121] X. Yang, W. Li, and K. Fan, “A revocable attribute-based encryption\nEHR sharing scheme with multiple authorities in blockchain,” Peer-to-\npeer Networking and Applications, vol. 16, no. 1, pp. 107–125, 2023.\n[122] N. Keizer et al., “The case for AI based Web3 reputation systems,” in\n2021 IFIP Networking Conference (IFIP Networking), 2021, pp. 1–2.\n[123] J. Lorenz et al., “Machine learning methods to detect money laun-\ndering in the Bitcoin blockchain in the presence of label scarcity,” in\nProceedings of the first ACM international conference on AI in finance,\nOct. 2021, pp. 1–8.\n[124] M. Weber et al., “Anti-money laundering in Bitcoin: Experimenting\nwith graph convolutional networks for financial forensics,” 2019, arXiv\npreprint arXiv:1908.02591.\n[125] I. Alarab and S. Prakoonwit, “Graph-based LSTM for anti-money\nlaundering: Experimenting temporal graph convolutional network with\nbitcoin data,” Neural Processing Letters, vol. 55, no. 1, pp. 689–707,\n2023.\n[126] W. Lo et al., “Inspection-l: self-supervised GNN node embeddings for\nmoney laundering detection in bitcoin,” Applied Intelligence, vol. 53,\npp. 19 406–19 417, Aug 2023.\n[127] M. Unzeelah and Z. Memon, “Fighting against fake news by connecting\nmachine learning approaches with Web3,” in 2022 International Con-\nference on Emerging Trends in Smart Technologies (ICETST), 2022,\npp. 1–6.\n[128] J. Kim et al., “A machine learning approach to anomaly detection\nbased on traffic monitoring for secure blockchain networking,” IEEE\nTransactions on Network and Service Management, vol. 19, no. 3, pp.\n3619–3632, 2022.\n[129] M. Xu et al., “When quantum information technologies meet\nblockchain in Web 3.0,” IEEE Network, 2023.\n[130] G. Yu et al., “Predicting NFT classification with GNN: A recommender\nsystem for Web3 assets,” in 2023 IEEE International Conference on\nBlockchain and Cryptocurrency (ICBC), 2023, pp. 1–5.\n[131] R. Madhwal and J. Pouwelse, “Web3recommend: Decentralised\nrecommendations with trust and relevance,” 2023, arXiv preprint\narXiv:2307.01411.\n[132] Z. Xiong et al., “When mobile blockchain meets edge computing,”\nIEEE Communications Magazine, vol. 56, no. 8, pp. 33–39, 2018.\n[133] A. Singh and K. Chatterjee, “Securing smart healthcare system with\nedge computing,” Computers & Security, vol. 108, 2021.\n[134] T. Qiu et al., “Edge computing in industrial Internet of Things:\nArchitecture, advances and challenges,” IEEE Communications Surveys\n& Tutorials, vol. 22, no. 4, pp. 2462–2488, 2020.\n[135] L. Lin et al., “Computation offloading toward edge computing,” Pro-\nceedings of the IEEE, vol. 107, no. 8, pp. 1584–1607, 2019.\n[136] T. Silva, “Cloud computing or edge computing: Cost comparison,” ht\ntps://www.azion.com/en/blog/cloud-computing-or-edge-computing-c\nost/, Dec. 2022.\n[137] M. Liu et al., “Computation offloading and content caching in wireless\nblockchain networks with mobile edge computing,” IEEE Transactions\non Vehicular Technology, vol. 67, no. 11, pp. 11 008–11 021, 2018.\n[138] Y. Zhu et al., “Blockchain-enabled access management system for edge\ncomputing,” Electronics, vol. 10, no. 9, 2021.\n[139] D. Doe et al., “Promoting the sustainability of blockchain in Web 3.0\nand the Metaverse through diversified incentive mechanism design,”\nIEEE Open Journal of the Computer Society, 2023.\n[140] X. Wang et al., “Convergence of edge computing and deep learning:\nA comprehensive survey,” IEEE Communications Surveys & Tutorials,\nvol. 22, no. 2, pp. 869–904, 2020.\n[141] S. Deng et al., “Edge intelligence: The confluence of edge computing\nand artificial intelligence,” IEEE Internet of Things Journal, vol. 7,\nno. 8, pp. 7457–7469, 2020.\n[142] L. Cao, “Decentralized AI: Edge intelligence and smart blockchain,\nmetaverse, Web3, and desci,” IEEE Intelligent Systems, vol. 37, no. 3,\npp. 6–19, 2022.\n[143] N. Luong et al., “Optimal auction for edge computing resource man-\nagement in mobile blockchain networks: A deep learning approach,” in\n2018 IEEE international conference on communications (ICC), 2018,\npp. 1–6.\n[144] R. Wang et al., “A video surveillance system based on permissioned\nblockchains and edge computing,” in 2019 IEEE international confer-\nence on big data and smart computing (BigComp), 2019, pp. 1–6.\n[145] N. Kuznetsov, “Facebook’s centralized metaverse a threat to the decen-\ntralized ecosystem?” https://cointelegraph.com/news/facebook-s-centr\nalized-metaverse-a-threat-to-the-decentralized-ecosystem, Nov. 2021.\n[146] A. Jeffries, “Can Facebook align with the values of the metaverse?”\nhttps://www.marketingdive.com/news/can-facebook-align-with-value\ns-metaverse/608768/, Oct. 2021.\n[147] M. Lodge, “What is decentraland?” https://www.investopedia.com/w\nhat-is-decentraland-6827259, Nov. 2022.\n[148] Ethereum, “Non-fungible tokens (NFT),” https://ethereum.org/en/nft/\n#what-are-nfts.\n[149] Q. Wang, R. Li, Q. Wang, and S. Chen, “Non-fungible token (NFT):\nOverview, evaluation, opportunities and challenges,” 2021, arXiv\npreprint arXiv:2105.07447.\n[150] W. Rehman, H. Zainab, J. Imran, and N. Bawany, “NFTs: Applications\nand challenges,” in International Arab Conference on Information\nTechnology (ACIT).\nIEEE, 2021, pp. 1–7.\n[151] U. Chohan, “Non-fungible tokens: Blockchains, scarcity, and value,”\nCritical Blockchain Research Initiative (CBRI) Working Papers, 2021.\n[152] L. Yang et al., “Generic-NFT: A generic non-fungible token architec-\nture for flexible value transfer in Web3,” 2023, techRxiv preprint.\n[153] E. Lopez, “Securechain,” https://github.com/eduardfina/Securechain,\nJun. 2023.\n[154] J. Zhu et al., “NFTool,” https://github.com/Bobliuuu/NFTool, Aug.\n2023.\n[155] C. Adiloglu, “StoryChain,” https://storychain.ai, Mar. 2023.\n[156] K. Busch, “Non-fungible tokens (NFTs),” https://crsreports.congress.\ngov/product/pdf/R/R47189, Jul. 2022.\n[157] Q. Wang et al., “Non-fungible token (NFT): Overview, evaluation,\nopportunities and challenges,” 2021, arXiv preprint arXiv:2105.07447.\n34\n[158] R. Kr¨aussl and A. Tugnetti, “Non-fungible tokens (NFTs): A review\nof pricing determinants, applications and opportunities,” Applications\nand Opportunities, 2022.\n[159] D. Zetzsche, D. Arner, and R. Buckley, “Decentralized finance,”\nJournal of Financial Regulation, vol. 6, no. 2, pp. 172–203, 2020.\n[160] S. Werner et al., “SoK: Decentralized finance (DeFi),” 2021, arXiv\npreprint arXiv:2101.08778.\n[161] P. Winter, A. Lorimer, P. Snyder, and B. Livshits, “What’s in your\nwallet? privacy and security issues in Web 3.0,” 2021, arXiv preprint\narXiv:2109.06836.\n[162] E. Jiang et al., “Decentralized finance (DeFi): A survey,” 2023, arXiv\npreprint arXiv:2308.05282.\n[163] Q. Kaihua et al., “CeFi vs. DeFi–comparing centralized to decentral-\nized finance,” 2021, arXiv preprint arXiv:2106.08157.\n[164] Ethereum, “Decentralized finance (DeFi),” https://ethereum.org/en/de\nfi/.\n[165] F. Sch¨ar, “Decentralized finance: On blockchain-and smart contract-\nbased financial markets,” FRB of St. Louis Review, 2021.\n[166] Y. Chen and C. Bellavitis, “Blockchain disruption and decentralized\nfinance: The rise of decentralized business models,” Journal of Business\nVenturing Insights, vol. 13, p. e00151, 2020.\n[167] C. Harvey, A. Ramachandran, and J. Santoro, DeFi and the Future of\nFinance.\nJohn Wiley & Sons, 2021.\n[168] X. Zhao et al., “FinBrain: when finance meets AI 2.0,” Frontiers of\nInformation Technology & Electronic Engineering, vol. 20, no. 7, pp.\n914–924, 2019.\n[169] L. Cao, “AI in finance: A review,” Available at SSRN 3647625, 2020.\n[170] N. Sadman et al., “Promise of AI in DeFi, A systematic review,”\nDigital, vol. 2, no. 1, pp. 88–103, 2022.\n[171] EasyFi, “Artificial intelligence (AI) & decentralized finance (DeFi): A\nmatch made in heaven,” https://medium.com/easify-network/artificia\nl-intelligence-ai-decentralized-finance-defi-a-match-made-in-heave\nn-483d24129481, Feb. 2023.\n[172] Binance, “How AI will influence DeFi: Promises and delusions.”\n[173] Y. Goyal et al., “AgroSurance,” https://github.com/agrosurance, Mar.\n2023.\n[174] A. Kondaurova and K. Orlov, “Prompt DeFi,” https://github.com/Dig\nberi/promptdefi-web, Mar. 2023.\n[175] A. Dubyk et al., “RoboFI,” https://robofi.482.solutions/, Jul. 2023.\n[176] G. Iredale, “Pros and cons of decentralized finance (DeFi),” https:\n//101blockchains.com/pros-and-cons-of-decentralized-finance/, Jul.\n2021.\n[177] C. Chen et al., “When digital economy meets Web 3.0: Applications\nand challenges,” IEEE Open Journal of the Computer Society, 2022.\n[178] W. Ma et al., “A comprehensive study of governance issues in decen-\ntralized finance applications,” 2023, arXiv preprint arXiv:2311.01433.\n[179] R. Qin et al., “Web3-based decentralized autonomous organizations\nand operations: Architectures, models, and mechanisms,” IEEE Trans-\nactions on Systems, Man, and Cybernetics: Systems, vol. 53, no. 4, pp.\n2073–2082, 2022.\n[180] S. Wang et al., “Decentralized autonomous organizations: Concept,\nmodel, and applications,” IEEE Transactions on Computational Social\nSystems, vol. 6, no. 5, pp. 870–878, 2019.\n[181] R. Qin et al., “Web3-based decentralized autonomous organizations\nand operations: Architectures, models, and mechanisms,” IEEE Trans-\nactions on Systems, Man, and Cybernetics: Systems, 2022.\n[182] Ethereum, “Decentralized autonomous organizations (DAOs),” https:\n//ethereum.org/en/dao/.\n[183] Y. E. Faqir, J. Arroyo, and S. Hassan, “An overview of decentralized\nautonomous organizations on the blockchain,” in Proceedings of the\n16th international symposium on open collaboration, 2020, pp. 1–8.\n[184] X. Zhao et al., “Task management in decentralized autonomous or-\nganization,” Journal of Operations Management, vol. 68, no. 6-7, pp.\n649–674, 2022.\n[185] C. Santana and L. Albareda, “Blockchain and the emergence of\ndecentralized autonomous organizations (DAOs): An integrative model\nand research agenda,” Technological Forecasting and Social Change,\nvol. 182, p. 121806, 2022.\n[186] M. Haque and M. H. S. Hossain, “A comprehensive review and\narchitecture of a decentralized automated direct government system\nusing artificial intelligence and blockchain,” International Journal of\nScientific & Engineering Research, vol. 13, 2022.\n[187] K. Nayan, “OmniGovern DAO,” https://github.com/kamalbuilds/Omn\niGovern-DAO/, Aug. 2023.\n[188] D. Duportail, “Rooster DAO,” https://github.com/RoosterDao, Jul.\n2022.\n[189] S. Kapadia, A. Aghadi, and N. Lionis, “DAOasis,” https://github.com\n/Suhel-Kap/DAOasis, Mar. 2023.\n[190] W. Ding et al., “Desci based on Web3 and DAO: A comprehensive\noverview and reference model,” IEEE Transactions on Computational\nSocial Systems, vol. 9, no. 5, pp. 1563–1573, 2022.\n[191] G.\nYu\net\nal.,\n“Leveraging\narchitectural\napproaches\nin\nWeb3\napplications-a DAO perspective focused,” in 2023 IEEE International\nConference on Blockchain and Cryptocurrency (ICBC), 2023, pp. 1–6.\n[192] D. Gogel, B. Kremer, A. Slavin, and K. Werbach, “Decentralized\nautonomous organizations: Beyond the hype,” White Paper, Jun. 2022.\n[193] J. Tan et al., “Open problems in DAOs,” 2023, arXiv preprint\narXiv:2310.19201.\n[194] R. Rudman and R. Bruwer, “Defining Web 3.0: Opportunities and\nchallenges,” The Electronic Library, 2016.\n[195] D. Sheridan et al., “Web3 challenges and opportunities for the market,”\n2022, arXiv preprint arXiv:2209.02446.\n[196] Y. Fan et al., “The current opportunities and challenges of Web 3.0,”\n2023, arXiv preprint arXiv:2306.03351.\n[197] C. Barabas, N. Narula, and E. Zuckerman, “Defending Internet freedom\nthrough decentralization: Back to the future,” The Center for Civic\nMedia & The Digital Currency Initiative MIT Media Lab, 2017.\n[198] SolanaStatus, “An incident resulted in approximately 8,000 wallets\nbeing drained,” https://twitter.com/SolanaStatus, Aug. 2022.\n[199] M. Egkolfopoulou and A. Gardner, “Even in the Metaverse, not all\nidentities are created equal,” https://www.bloomberg.com/news/feature\ns/2021-12-06/cryptopunk-nft-prices-suggest-a-diversity-problem-in-t\nhe-metaverse#xj4y7vzkg, Dec. 2021.\n[200] J. Apotheker et al., “Web3 already has a gender diversity problem,”\nhttps://www.bcg.com/publications/2023/how-to-unravel-lack-of-gende\nr-diversity-web3, Feb. 2023.\n[201] Reuters, “Amazon scrapped a secret AI recruitment tool that showed\nbias against women,” https://venturebeat.com/ai/amazon-scrapped-a\n-secret-ai-recruitment-tool-that-showed-bias-against-women/, Oct.\n2018.\n[202] H. Ledford, “Millions of black people affected by racial bias in health-\ncare algorithms,” https://www.nature.com/articles/d41586-019-03228\n-6, Oct. 2019.\n[203] M. Antonakakis et al., “Understanding the mirai botnet,” in 26th\nUSENIX security symposium (USENIX Security 17), 2017, pp. 1093–\n1110.\n[204] X. Jin et al., “Edge security: Challenges and issues,” 2022, arXiv\npreprint arXiv:2206.07164.\n",
    "ref": [
        "2206.08821",
        "2304.06032",
        "2303.13050",
        "2305.00427",
        "2309.09972",
        "2001.07091",
        "2203.00398",
        "2210.05903",
        "2305.11911",
        "2308.04942",
        "2308.15483",
        "2310.17705",
        "2301.03220",
        "2303.02836",
        "2305.12130",
        "2303.13052",
        "2309.01426",
        "2303.04226",
        "2303.11717",
        "2302.06476",
        "1908.02591",
        "2307.01411",
        "2105.07447",
        "2105.07447",
        "2101.08778",
        "2109.06836",
        "2308.05282",
        "2106.08157",
        "2311.01433",
        "2310.19201",
        "2209.02446",
        "2306.03351",
        "2206.07164"
    ]
}