{
    "2106.08157": {
        "title": "CeFi vs. DeFi -- Comparing Centralized to Decentralized Finance",
        "abstract": "To non-experts, the traditional Centralized Finance (CeFi) ecosystem may seem\nobscure, because users are typically not aware of the underlying rules or\nagreements of financial assets and products. Decentralized Finance (DeFi),\nhowever, is making its debut as an ecosystem claiming to offer transparency and\ncontrol, which are partially attributable to the underlying integrity-protected\nblockchain, as well as currently higher financial asset yields than CeFi. Yet,\nthe boundaries between CeFi and DeFi may not be always so clear cut.\n  In this work, we systematically analyze the differences between CeFi and\nDeFi, covering legal, economic, security, privacy and market manipulation. We\nprovide a structured methodology to differentiate between a CeFi and a DeFi\nservice. Our findings show that certain DeFi assets (such as USDC or USDT\nstablecoins) do not necessarily classify as DeFi assets, and may endanger the\neconomic security of intertwined DeFi protocols. We conclude this work with the\nexploration of possible synergies between CeFi and DeFi.",
        "date": "2021-06-15T13:53:43+00:00",
        "label": 1
    },
    "1406.2222": {
        "title": "The Chemistry Between High School Students and Computer Science",
        "abstract": "Computer science enrollments have started to rise again, but the percentage\nof women undergraduates in computer science is still low. Some studies indicate\nthis might be due to a lack of awareness of computer science at the high school\nlevel. We present our experiences running a 5-year, high school outreach\nprogram that introduces information about computer science within the context\nof required chemistry courses. We developed interactive worksheets using\nMolecular Workbench that help the students learn chemistry and computer science\nconcepts related to relevant events such as the gulf oil spill. Our evaluation\nof the effectiveness of this approach indicates that the students do become\nmore aware of computer science as a discipline, but system support issues in\nthe classroom can make the approach difficult for teachers and discouraging for\nthe students.",
        "date": "2014-06-09T15:44:41+00:00",
        "label": 0
    },
    "2202.01291": {
        "title": "Computer sciences and synthesis: retrospective and perspective",
        "abstract": "The problem of synthesis in computer sciences, including cybernetics,\nartificial intelligence and system analysis, is analyzed. Main methods of\nrealization this problem are discussed. Ways of search universal method of\ncreation universal synthetic science are represented. As example of such\nuniversal method polymetric analysis is given. Perspective of further\ndevelopment of this research, including application polymetric method for the\nresolution main problems of computer sciences, is analyzed too.",
        "date": "2022-01-26T04:42:45+00:00",
        "label": 0
    },
    "2206.12669": {
        "title": "Crypto Makes AI Evolve",
        "abstract": "Adopting cryptography has given rise to a significant evolution in Artificial\nIntelligence (AI). This paper studies the path and stages of this evolution. We\nstart with reviewing existing relevant surveys, noting their shortcomings,\nespecially the lack of a close look at the evolution process and solid future\nroadmap. These shortcomings justify the work of this paper. Next, we identify,\ndefine and discuss five consequent stages in the evolution path, including\nCrypto-Sensitive AI, Crypto-Adapted AI, Crypto-Friendly AI, Crypto-Enabled AI,\nCrypto-Protected AI. Then, we establish a future roadmap for further research\nin this area, focusing on the role of quantum-inspired and bio-inspired AI.",
        "date": "2022-06-25T15:04:47+00:00",
        "label": 0
    },
    "2303.04226": {
        "title": "A Comprehensive Survey of AI-Generated Content (AIGC): A History of Generative AI from GAN to ChatGPT",
        "abstract": "Recently, ChatGPT, along with DALL-E-2 and Codex,has been gaining significant\nattention from society. As a result, many individuals have become interested in\nrelated resources and are seeking to uncover the background and secrets behind\nits impressive performance. In fact, ChatGPT and other Generative AI (GAI)\ntechniques belong to the category of Artificial Intelligence Generated Content\n(AIGC), which involves the creation of digital content, such as images, music,\nand natural language, through AI models. The goal of AIGC is to make the\ncontent creation process more efficient and accessible, allowing for the\nproduction of high-quality content at a faster pace. AIGC is achieved by\nextracting and understanding intent information from instructions provided by\nhuman, and generating the content according to its knowledge and the intent\ninformation. In recent years, large-scale models have become increasingly\nimportant in AIGC as they provide better intent extraction and thus, improved\ngeneration results. With the growth of data and the size of the models, the\ndistribution that the model can learn becomes more comprehensive and closer to\nreality, leading to more realistic and high-quality content generation. This\nsurvey provides a comprehensive review on the history of generative models, and\nbasic components, recent advances in AIGC from unimodal interaction and\nmultimodal interaction. From the perspective of unimodality, we introduce the\ngeneration tasks and relative models of text and image. From the perspective of\nmultimodality, we introduce the cross-application between the modalities\nmentioned above. Finally, we discuss the existing open problems and future\nchallenges in AIGC.",
        "date": "2023-03-07T20:36:13+00:00",
        "label": 1
    },
    "1710.03090": {
        "title": "Theoretical Computer Science for the Working Category Theorist",
        "abstract": "Theoretical computer science discusses foundational issues about\ncomputations. It asks and answers questions such as \"What is a computation?\",\n\"What is computable?\", \"What is efficiently computable?\",\"What is\ninformation?\", \"What is random?\", \"What is an algorithm?\", etc. We will present\nmany of the major themes and theorems with the basic language of category\ntheory. Surprisingly, many interesting theorems and concepts of theoretical\ncomputer science are easy consequences of functoriality and composition when\nyou look at the right categories and functors connecting them.",
        "date": "2017-10-04T19:19:00+00:00",
        "label": 0
    },
    "2303.02836": {
        "title": "Blockchain-Empowered Lifecycle Management for AI-Generated Content (AIGC) Products in Edge Networks",
        "abstract": "The rapid development of Artificial IntelligenceGenerated Content (AIGC) has\nbrought daunting challenges regarding service latency, security, and\ntrustworthiness. Recently, researchers presented the edge AIGC paradigm,\neffectively optimize the service latency by distributing AIGC services to edge\ndevices. However, AIGC products are still unprotected and vulnerable to\ntampering and plagiarization. Moreover, as a kind of online non-fungible\ndigital property, the free circulation of AIGC products is hindered by the lack\nof trustworthiness in open networks. In this article, for the first time, we\npresent a blockchain-empowered framework to manage the lifecycle of edge AIGC\nproducts. Specifically, leveraging fraud proof, we first propose a protocol to\nprotect the ownership and copyright of AIGC, called Proof-of-AIGC. Then, we\ndesign an incentive mechanism to guarantee the legitimate and timely executions\nof the funds-AIGC ownership exchanges among anonymous users. Furthermore, we\nbuild a multi-weight subjective logic-based reputation scheme, with which AIGC\nproducers can determine which edge service provider is trustworthy and reliable\nto handle their services. Through numerical results, the superiority of the\nproposed approach is demonstrated. Last but not least, we discuss important\nopen directions for further research.",
        "date": "2023-03-06T02:06:13+00:00",
        "label": 1
    },
    "2207.07901": {
        "title": "Computer Science",
        "abstract": "Possible for science itself, conceptually, to have and will understand\ndifferently, let alone science also seen as technology, such as computer\nscience. After all, science and technology are viewpoints diverse by either\nindividual, community, or social. Generally, it depends on socioeconomic\ncapabilities. So it is with computer science has become a phenomenon and\nfashionable, where based on the stream of documents, various issues arise in\neither its theory or implementation, adapting different communities, or\ndesigning curriculum holds in the education system.",
        "date": "2022-07-16T10:54:57+00:00",
        "label": 0
    },
    "2303.11717": {
        "title": "A Complete Survey on Generative AI (AIGC): Is ChatGPT from GPT-4 to GPT-5 All You Need?",
        "abstract": "As ChatGPT goes viral, generative AI (AIGC, a.k.a AI-generated content) has\nmade headlines everywhere because of its ability to analyze and create text,\nimages, and beyond. With such overwhelming media coverage, it is almost\nimpossible for us to miss the opportunity to glimpse AIGC from a certain angle.\nIn the era of AI transitioning from pure analysis to creation, it is worth\nnoting that ChatGPT, with its most recent language model GPT-4, is just a tool\nout of numerous AIGC tasks. Impressed by the capability of the ChatGPT, many\npeople are wondering about its limits: can GPT-5 (or other future GPT variants)\nhelp ChatGPT unify all AIGC tasks for diversified content creation? Toward\nanswering this question, a comprehensive review of existing AIGC tasks is\nneeded. As such, our work comes to fill this gap promptly by offering a first\nlook at AIGC, ranging from its techniques to applications. Modern generative AI\nrelies on various technical foundations, ranging from model architecture and\nself-supervised pretraining to generative modeling methods (like GAN and\ndiffusion models). After introducing the fundamental techniques, this work\nfocuses on the technological development of various AIGC tasks based on their\noutput type, including text, images, videos, 3D content, etc., which depicts\nthe full potential of ChatGPT's future. Moreover, we summarize their\nsignificant applications in some mainstream industries, such as education and\ncreativity content. Finally, we discuss the challenges currently faced and\npresent an outlook on how generative AI might evolve in the near future.",
        "date": "2023-03-21T10:09:47+00:00",
        "label": 1
    },
    "2206.07164": {
        "title": "Edge Security: Challenges and Issues",
        "abstract": "Edge computing is a paradigm that shifts data processing services to the\nnetwork edge, where data are generated. While such an architecture provides\nfaster processing and response, among other benefits, it also raises critical\nsecurity issues and challenges that must be addressed. This paper discusses the\nsecurity threats and vulnerabilities emerging from the edge network\narchitecture spanning from the hardware layer to the system layer. We further\ndiscuss privacy and regulatory compliance challenges in such networks. Finally,\nwe argue the need for a holistic approach to analyze edge network security\nposture, which must consider knowledge from each layer.",
        "date": "2022-06-14T20:49:48+00:00",
        "label": 1
    },
    "2305.11911": {
        "title": "A Unified Framework for Integrating Semantic Communication and AI-Generated Content in Metaverse",
        "abstract": "As the Metaverse continues to grow, the need for efficient communication and\nintelligent content generation becomes increasingly important. Semantic\ncommunication focuses on conveying meaning and understanding from user inputs,\nwhile AI-Generated Content utilizes artificial intelligence to create digital\ncontent and experiences. Integrated Semantic Communication and AI-Generated\nContent (ISGC) has attracted a lot of attentions recently, which transfers\nsemantic information from user inputs, generates digital content, and renders\ngraphics for Metaverse. In this paper, we introduce a unified framework that\ncaptures ISGC two primary benefits, including integration gain for optimized\nresource allocation and coordination gain for goal-oriented high-quality\ncontent generation to improve immersion from both communication and content\nperspectives. We also classify existing ISGC solutions, analyze the major\ncomponents of ISGC, and present several use cases. We then construct a case\nstudy based on the diffusion model to identify an optimal resource allocation\nstrategy for performing semantic extraction, content generation, and graphic\nrendering in the Metaverse. Finally, we discuss several open research issues,\nencouraging further exploring the potential of ISGC and its related\napplications in the Metaverse.",
        "date": "2023-05-18T02:02:36+00:00",
        "label": 1
    },
    "0609110": {
        "title": "Algebraic recognizability of languages",
        "abstract": "Recognizable languages of finite words are part of every computer science\ncursus, and they are routinely described as a cornerstone for applications and\nfor theory. We would like to briefly explore why that is, and how this\nword-related notion extends to more complex models, such as those developed for\nmodeling distributed or timed behaviors.",
        "date": "2006-09-19T15:21:08+00:00",
        "label": 0
    },
    "2101.08778": {
        "title": "SoK: Decentralized Finance (DeFi)",
        "abstract": "Decentralized Finance (DeFi), a blockchain powered peer-to-peer financial\nsystem, is mushrooming. Two years ago the total value locked in DeFi systems\nwas approximately 700m USD, now, as of April 2022, it stands at around 150bn\nUSD. The frenetic evolution of the ecosystem has created challenges in\nunderstanding the basic principles of these systems and their security risks.\nIn this Systematization of Knowledge (SoK) we delineate the DeFi ecosystem\nalong the following axes: its primitives, its operational protocol types and\nits security. We provide a distinction between technical security, which has a\nhealthy literature, and economic security, which is largely unexplored,\nconnecting the latter with new models and thereby synthesizing insights from\ncomputer science, economics and finance. Finally, we outline the open research\nchallenges in the ecosystem across these security types.",
        "date": "2021-01-21T18:58:43+00:00",
        "label": 1
    },
    "2303.13052": {
        "title": "Diffusion-based Reinforcement Learning for Edge-enabled AI-Generated Content Services",
        "abstract": "As Metaverse emerges as the next-generation Internet paradigm, the ability to\nefficiently generate content is paramount. AIGenerated Content (AIGC) emerges\nas a key solution, yet the resource intensive nature of large Generative AI\n(GAI) models presents challenges. To address this issue, we introduce an\nAIGC-as-a-Service (AaaS) architecture, which deploys AIGC models in wireless\nedge networks to ensure broad AIGC services accessibility for Metaverse users.\nNonetheless, an important aspect of providing personalized user experiences\nrequires carefully selecting AIGC Service Providers (ASPs) capable of\neffectively executing user tasks, which is complicated by environmental\nuncertainty and variability. Addressing this gap in current research, we\nintroduce the AI-Generated Optimal Decision (AGOD) algorithm, a diffusion\nmodel-based approach for generating the optimal ASP selection decisions.\nIntegrating AGOD with Deep Reinforcement Learning (DRL), we develop the Deep\nDiffusion Soft Actor-Critic (D2SAC) algorithm, enhancing the efficiency and\neffectiveness of ASP selection. Our comprehensive experiments demonstrate that\nD2SAC outperforms seven leading DRL algorithms. Furthermore, the proposed AGOD\nalgorithm has the potential for extension to various optimization problems in\nwireless networks, positioning it as a promising approach for future research\non AIGC-driven services. The implementation of our proposed method is available\nat: https://github.com/Lizonghang/AGOD.",
        "date": "2023-03-23T05:54:45+00:00",
        "label": 1
    },
    "9505013": {
        "title": "Wavelet basis for the Schrödinger equation",
        "abstract": "The self-similar representation for the Schr\\\"{o}dinger equation is derived.",
        "date": "1995-05-16T16:19:16+00:00",
        "label": 0
    },
    "2206.08821": {
        "title": "Exploring Web3 From the View of Blockchain",
        "abstract": "Web3 is the most hyped concept from 2020 to date, greatly motivating the\nprosperity of the Internet of Value and Metaverse. However, no solid evidence\nstipulates the exact definition, criterion, or standard in the sense of such a\nbuzzword. To fill the gap, we aim to clarify the term in this work. We narrow\ndown the connotation of Web3 by separating it from high-level controversy\nargues and, instead, focusing on its protocol, architecture, and evaluation\nfrom the perspective of blockchain fields. Specifically, we have identified all\npotential architectural design types and evaluated each of them by employing\nthe scenario-based architecture evaluation method. The evaluation shows that\nexisting applications are neither secure nor adoptable as claimed. Meanwhile,\nwe also discuss opportunities and challenges surrounding the Web3 space and\nanswer several prevailing questions from communities. A primary result is that\nWeb3 still relies on traditional internet infrastructure, not as independent as\nadvocated. This report, as of June 2022, provides the first strict research on\nWeb3 in the view of blockchain. We hope that this work would provide a guide\nfor the development of future Web3 services.",
        "date": "2022-06-17T15:01:23+00:00",
        "label": 1
    },
    "1404.5458": {
        "title": "Complex Workflow Management and Integration of Distributed Computing Resources by Science Gateway Portal for Molecular Dynamics Simulations in Materials Science",
        "abstract": "The \"IMP Science Gateway Portal\" (http://scigate.imp.kiev.ua) for complex\nworkflow management and integration of distributed computing resources (like\nclusters, service grids, desktop grids, clouds) is presented. It is created on\nthe basis of WS-PGRADE and gUSE technologies, where WS-PGRADE is designed for\nscience workflow operation and gUSE - for smooth integration of available\nresources for parallel and distributed computing in various heterogeneous\ndistributed computing infrastructures (DCI). The typical scientific workflow\nwith possible scenarios of its preparation and usage is considered. Several\ntypical science applications (scientific workflows) are considered for\nmolecular dynamics (MD) simulations of complex behavior of various\nnanostructures (nanoindentation of graphene layers, defect system relaxation in\nmetal nanocrystals, thermal stability of boron nitride nanotubes, etc.). The\nadvantages and drawbacks of the solution are shortly analyzed in the context of\nits practical applications for MD simulations in materials science, physics and\nnanotechnologies with available heterogeneous DCIs.",
        "date": "2014-04-22T11:34:04+00:00",
        "label": 0
    },
    "2007.08087": {
        "title": "Starting with data: advancing spatial data science by building and sharing high-quality datasets",
        "abstract": "Spatial data science has emerged in recent years as an interdisciplinary\nfield. This position paper discusses the importance of building and sharing\nhigh-quality datasets for spatial data science.",
        "date": "2020-07-16T03:15:56+00:00",
        "label": 0
    },
    "1103.3321": {
        "title": "Typed Operational Semantics for Dependent Record Types",
        "abstract": "Typed operational semantics is a method developed by H. Goguen to prove\nmeta-theoretic properties of type systems. This paper studies the metatheory of\na type system with dependent record types, using the approach of typed\noperational semantics. In particular, the metatheoretical properties we have\nproved include strong normalisation, Church-Rosser and subject reduction.",
        "date": "2011-03-17T00:19:42+00:00",
        "label": 0
    },
    "2303.13050": {
        "title": "Building Resilient Web 3.0 with Quantum Information Technologies and Blockchain: An Ambilateral View",
        "abstract": "Web 3.0 pursues the establishment of decentralized ecosystems based on\nblockchain technologies to drive the digital transformation of physical\ncommerce and governance. Through consensus algorithms and smart contracts in\nblockchain, which are based on cryptography technologies, digital identity,\ndigital asset management, decentralized autonomous organization, and\ndecentralized finance are realized for secure and transparent digital economy\nservices in Web 3.0 for promoting the integration of digital and physical\neconomies. With the rapid realization of quantum devices, Web 3.0 is being\ndeveloped in parallel with the deployment of quantum cloud computing and\nquantum Internet. In this regard, quantum computing first disrupts the original\ncryptographic systems that protect data security while reshaping modern\ncryptography with the advantages of quantum computing and communication.\nTherefore, this survey provides a comprehensive overview of blockchain-based\nWeb 3.0 and its quantum and post-quantum enhancement from the ambilateral\nperspective. On the one hand, some post-quantum migration methods, and\nanti-quantum signatures offer potential ways to achieve unforgeable security\nunder quantum attack for the internal technologies of blockchain. On the other\nhand, some quantum/post-quantum encryption and verification algorithms improve\nthe external performance of the blockchain, enabling a decentralized, valuable,\nsecure blockchain system. Finally, we discuss the future directions toward\ndeveloping a provable secure decentralized digital ecosystem.",
        "date": "2023-03-23T05:50:38+00:00",
        "label": 1
    }
}